You have to work on the [University dataset](https://drive.google.com/drive/folders/1Hs3nRtK_F3h8eg59B4-TD1DEua6g8Klv?usp=sharing). It contains three different university rankings:
*  The Times Higher Education World University Ranking, shortly *Times*,
*  the Academic Ranking of World Universities, shortly *Shanghai*,
*  the Center for World University Rankings, shortly *cwur*.

### Notes

1.    It is mandatory to use GitHub for developing the project.
1.    The project must be a jupyter notebook.
1.    There is no restriction on the libraries that can be used, nor on the Python version.
1.    All questions on the project **must** be asked in a public channel on [Zulip](https://focs.zulipchat.com).

In [1]:
import pandas as pd
import numpy as np
import re
import math

First of all we open the three datasets of the university rankings and create three corresponding dataframes.
We use the _head( )_ function to check if the dataframe has been defined correctly.

In [2]:
cwur=pd.read_csv("cwurData.csv")
cwur.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [3]:
shanghai=pd.read_csv("shanghaiData.csv")
shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [4]:
times=pd.read_csv("timesData.csv")
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

### 1. For each university, extract from the *times* dataset the most recent and the least recent data, obtaining two separate dataframes

We apply the function `idxmax()` to the field *year* with the function `groupby`: in this way, for every university, we obtain the index of the row with the maximum year. Then, to access the rows of the *times* dataset related to the data identified by the function `idxmax()`, we use the `loc` function.

In [5]:
times_most=times.loc[times.groupby('university_name').year.idxmax()]
times_most.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

We proceed in analogy to what we have just done to find the rows related to the least recent data for each university.

In [6]:
times_least=times.loc[times.groupby('university_name').year.idxmin()]
times_least.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

### 2. For each university, compute the improvement in `income` between the least recent and the most recent data points

To calculate the improvement in income, we need to work on both the *times_most* table and the *times_least* table: we use the merge function to build the *improvement* table, which contains all the data we need. Moreover, where the income data is missing, we replace the symbol "-" with the constant value *NaN*.

In [7]:
improvement=pd.merge(times_most[['university_name','income','year']], times_least[['university_name','income','year']], on='university_name', suffixes=['_most', '_least'])
improvement['income_most']=improvement['income_most'].replace('-', np.NaN)
improvement['income_least']=improvement['income_least'].replace('-', np.NaN)
improvement.head()

,university_name,income_most,year_most,income_least,year_least
0,AGH University of Science and Technology,NaN,2016,NaN,2016
1,Aalborg University,43.7,2016,36.4,2012
2,Aalto University,61.6,2016,61.9,2012
3,Aarhus University,68.3,2016,61.5,2011
4,Aberystwyth University,31.3,2016,35.5,2012

In order to create the *improvement (%)* column, we cast the income data to float. We then decided to calculate the improvement in income as the difference between the most recent year's income and the least recent year's income, normalized to the least recent year's income and expressed as a percentage. For example, if the income has doubled, our result must be 100%.

In [8]:
improvement["income_most"]=improvement["income_most"].astype(float)
improvement["income_least"]=improvement["income_least"].astype(float)
improvement["improvement (%)"]=round((improvement["income_most"]-improvement["income_least"])/improvement["income_least"]*100,2)
improvement

,university_name,income_most,year_most,income_least,year_least,improvement (%)
0,AGH University of Science and Technology,NaN,2016,NaN,2016,NaN
1,Aalborg University,43.7,2016,36.4,2012,20.05
2,Aalto University,61.6,2016,61.9,2012,-0.48
3,Aarhus University,68.3,2016,61.5,2011,11.06
4,Aberystwyth University,31.3,2016,35.5,2012,-11.83
...,...,...,...,...,...,...
813,École Normale Supérieure,37.1,2016,30.7,2011,20.85
814,École Normale Supérieure de Lyon,31.7,2016,26.1,2011,21.46
815,École Polytechnique,82.3,2016,NaN,2011,NaN
816,École Polytechnique Fédérale de Lausanne,65.4,2016,38.0,2011,72.11
817,Örebro University,29.8,2016,29.8,2016,0.00

### 3. Find the university with the largest increase computed in the previous point

We apply the `idxmax()` function to the field *improvement (%)* in order to obtain the index of the university with the maximum improvement. Then, to get which university has been identified by `idxmax()`, we use the `loc` function.

In [9]:
improvement.loc[improvement['improvement (%)'].idxmax()]

university_name    TU Dresden
income_most              99.7
year_most                2016
income_least             31.9
year_least               2012
improvement (%)        212.54
Name: 428, dtype: object

### 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for *Aarhus University* the value is 122-73=49). Notice that some rankings are expressed as a range

To obtain dataframes containing only the most recent data of each university, we proceed in analogy to what we did in the first exercise for the *times* dataset.

In the case of the *cwur* dataset, we rename the *institution* field to conform it to the *university_name* fields of the other two datasets.

In [10]:
cwur_new=cwur.loc[cwur.groupby('institution').year.idxmax()]
cwur_new.rename(columns={'institution':'university_name'}, inplace=True)
cwur_new.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

In [11]:
shanghai_new=shanghai.loc[shanghai.groupby('university_name').year.idxmax()]
shanghai_new.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011

In [12]:
times_new=times_most
times_new.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

We observe that there are names of universities written differently but which refer to the same authority. For example in the database *Shanghai_new* we have "Aix Marseille University" and "Aix-Marseille University" or in the database *Chwur_new* we have "University of Bordeaux" and "University of Bordeaux I", as shown below.

In [13]:
cwur_new[cwur_new['university_name'].str.contains('University of Bordeaux')]

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1498,299,University of Bordeaux,France,14,354,567,218,291,265,234,251.0,297,45.96,2015
631,432,University of Bordeaux I,France,17,355,478,210,327,228,406,361.0,426,45.41,2014
602,403,University of Bordeaux II,France,15,355,478,210,440,385,363,322.0,426,45.54,2014

We define a function that is able to normalize the university names within the three dataframes (shanghai_new, times_new and cwur_new). We use *school_and_country_table* as the reference database.

In [14]:
school_and_country=pd.read_csv("school_and_country_table.csv")
school_and_country.rename(columns={'school_name':'university_name_normalized'},inplace=True)
school_and_country.head()

              university_name_normalized                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

We create a list containing all the names of the universities taken from the *school_and_country* dataset.

In [15]:
university_name_normalized=[]
for university in school_and_country['university_name_normalized']:
    if university not in university_name_normalized:
        university_name_normalized.append(university)

To create the functions to normalize the names of universities we use functions contained in the *fuzzywuzzy* library and in particular in its module called *process*.

In [16]:
from fuzzywuzzy import process

* The funcion *name_normalized* takes as input the name of a university and returns, among all the universities in the *university_name_normalized* list, the one with the most similar name, based on the scores assigned by the *extractOne* method of the *fuzzywuzzy* library:

In [17]:
def name_normalized(university):
    return(process.extractOne(university, university_name_normalized)[0])

* The function *score_match* works the same as *name_normalized*, but it returns the score attributed to the university within the *university_name_normalized* list with the name closest to the university provided in input:

In [18]:
def score_match(university):
    return(int(process.extractOne(university, university_name_normalized)[1]))

* The function *perfect_match* iterates through all the names of the universities in the dataframe *school_and_country* and returns the string provided in input, if it exactly matches the name of a university in the dataframe:

In [19]:
def perfect_match(string):
    for university in school_and_country['university_name_normalized']:
        if string == university:
            return string

* The function *complete_procedure* takes a dataframe as input and uses the three functions described above:
    * a field called *university_name_normalized* is created inside the dataframe given in input, applying the *perfect_match* function to the *university_name* field;
    * a new DataFrame called *good* is created as a copy of the table given in input, keeping only the rows where the *university_name_normalized* field has non-null values. A field called *score* is added to the table *good*; *score* contains the value "100" for each row, as the *good* table has been created with the universities that have found a perfect match with the universities contained in the *school_and_country* dataframe;
    * another new DataFrame, called *dirty*, is created as the complement of *good* as it contains the universities that have not found a perfect match. In this case the *university_name_normalized* field is created by applying the *name_normalized* function to the *university_name* field. The *score* column is filled using the *score_match* function;
    * *complete_procedure* outputs the DataFrame obtained from the concatenation between the *good* and *dirty* dataframes.

In [20]:
def complete_procedure(table):
    table['university_name_normalized'] = table['university_name'].apply(perfect_match)
    good=table[table['university_name_normalized'].isnull()==False].copy()
    good['score']=100
    dirty=table[table['university_name_normalized'].isnull()==True].copy()
    dirty['university_name_normalized'] = dirty['university_name'].apply(name_normalized)
    dirty['score'] = dirty['university_name'].apply(score_match)
    return(pd.concat([good, dirty]))

* The function *delete* takes as input a list of indices, a DataFrame and an empty list, which must be filled with incorrect university names. The *delete* function for each element of the list of indices, that is, for each index, assigns the name of the university corresponding to that index to the variable *uni*. If the name of the university that has been assigned to *uni* has not already been added to the input list, it is added. The result of this function is therefore to obtain a list of wrong university names, without repetition:

In [21]:
def delete(indices, table, li):
    for el in indices:
        uni=table.loc[el]['university_name']
        if uni not in li:
            li.append(uni)

We create empty lists that will contain the wrong university names:

In [22]:
wrong_names_shanghai=[]
wrong_names_cwur=[]

We give the DataFrame containing the most recent data of the Shanghai dataset as input to the function *complete_procedure*:

In [23]:
shanghai_new=complete_procedure(shanghai_new)
shanghai_new.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,university_name_normalized,score
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,Aalborg University,100
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015,Aalto University,100
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,Aarhus University,100
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011,Aix-Marseille University,100
4798,401-500,Aristotle University of Thessaloniki,2,NaN,0.0,0.0,4.9,1.5,34.0,16.8,2015,Aristotle University of Thessaloniki,100

At this point we proceed with a manual cleaning operation to correct any errors made by *complete_procedure*.

We start by comparing the fields *university_name* and *university_name_normalized* of all the rows that were given a score lower than or equal to 86 (therefore very low). We observe that *university_name* and *university_name_normalized* in these cases never refer to the same university.

In [24]:
shanghai_new[shanghai_new['score']<=86].head(10)[['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
4498,Baylor College of Medicine,ETH Zurich – Swiss Federal Institute of Techno...
4698,Beihang University,"University of California, Berkeley"
4599,Beijing Normal University,Yale University
3416,Beijing University of Aeronautics and Astronau...,Harvard University
4699,Brigham Young University,Yale University
4809,Catholic University of Korea,Harvard University
3616,Catholic University of Leuven,Harvard University
4548,Catholic University of Louvain,Harvard University
4700,Central South University,Yale University
4705,City University of New York City College,Harvard University

We then give all the rows of the *shanghai_new* table that have scores less than or equal to 86 as input to the *delete* function. In this way we fill the *wrong_names_shanghai* list with all the *university_names* that do not match the *university_name_normalized* with which they have been paired.

In [25]:
delete(shanghai_new.index[shanghai_new['score']<=86], shanghai_new, wrong_names_shanghai)

The previous step was used to keep track of the rows containing the incorrect results of the *complete_procedure* function. We then remove these rows permanently from the *shanghai_new* DataFrame using the `drop` function`.

In [26]:
shanghai_new.drop(shanghai_new.index[shanghai_new['score']<=86], inplace=True)

This analysis procedure which includes:
* identification of the wrong pairings *university_name* and *university_name_normalized*;
* registration of the *university_name* in question in the list of wrong names;
* elimination of the rows containing those *university_name* from the DataFrame

is manually repeated for all scores above 86.

In [27]:
shanghai_new[shanghai_new['score']==87][['university_name', 'university_name_normalized']]

                  university_name          university_name_normalized
423     Loyola University Chicago               University of Chicago
438   Northern Arizona University               University of Arizona
3358   Sao Paulo State University  São Paulo State University (UNESP)
4763         University of Bochum              Ruhr University Bochum
4669        University of Leipzig                 University of Liège
2487        University of Lille 1                 University of Liège
4885        University of Rostock                  University of Oslo

In [28]:
delete([4669,2487,4885], shanghai_new, wrong_names_shanghai)

In [29]:
shanghai_new.drop([4669,2487,4885], inplace=True)

In [30]:
shanghai_new[shanghai_new['score']==88][['university_name', 'university_name_normalized']]

                       university_name   university_name_normalized
2931                  Gunma University             Hunan University
4528           University of Frankfurt  Goethe University Frankfurt
4773              University of Malaya        University of Calgary
4881          University of Regensburg     University of Gothenburg
494              University of Wroclaw         University of Warsaw
4596  Virginia Commonwealth University       University of Virginia
1508          West Virginia University       University of Virginia

In [31]:
delete([2931,4773,4881,494], shanghai_new, wrong_names_shanghai)

In [32]:
shanghai_new.drop([2931,4773,4881,494], inplace=True)

In [33]:
shanghai_new[shanghai_new['score']==89][['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
3722,Dresden University of Technology,Brno University of Technology
4829,Nara Institute of Science and Technology,Gwangju Institute of Science and Technology
2490,University of Louisville,University of Seville
1991,University of Maine,University of Miami
3494,University of Sherbrooke,Université de Sherbrooke
3498,University of Tromso,University of Oslo
4543,University of Wageningen,University of Groningen

In [34]:
delete([3722,4829,2490,1991,3498,4543], shanghai_new, wrong_names_shanghai)

In [35]:
shanghai_new.drop([3722,4829,2490,1991,3498,4543], inplace=True)

In [36]:
shanghai_new[shanghai_new['score']==90][['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
3425,Curtin University of Technology,Curtin University
4549,Erasmus University,Erasmus University Rotterdam
3430,Federal University of Sao Paulo,Federal University of São Carlos
4504,Indiana University Bloomington,Indiana University
4616,Indiana University-Purdue University at Indian...,Purdue University
4722,King Abdullah University of Science and Techno...,AGH University of Science and Technology
4624,Louisiana State University - Baton Rouge,Louisiana State University
925,Louisiana State University Health Sciences Center,Louisiana State University
4456,Pennsylvania State University - University Park,Pennsylvania State University
4458,Purdue University - West Lafayette,Purdue University
3741,"Queen Mary, U. of London",Queen Mary University of London
1965,Swansea Univ,Swansea University
3606,Texas A&M University - College Station,Texas A&M University
4464,The Ohio State University - Columbus,Ohio State University
3758,The University of Connecticut - Storrs,University of Connecticut
3461,The University of Connecticut Health Center,University of Connecticut
4250,The University of Montana - Missoula,University of Montana
4647,The University of New Mexico - Albuquerque,University of New Mexico
4749,"The University of Newcastle, Australia",University of Newcastle
4758,UNESP,São Paulo State University (UNESP)
4651,"University at Buffalo, the State University of...",University at Buffalo
4853,University of Arkansas at Fayetteville,University of Arkansas
4854,University of Arkansas at Little Rock,University of Arkansas
3466,University of Bari,University of Bari Aldo Moro
4771,University of Giessen,University of Essex
3783,University of Kansas - Lawrence,University of Kansas
2984,University of Kansas Medical Center,University of Kansas
4673,University of Mainz,Johannes Gutenberg University of Mainz
4674,University of Marburg,University of Würzburg
4534,University of Massachusetts Medical School - W...,University of Massachusetts
3820,University of Michigan - Ann Arbor,University of Michigan
4426,"University of Minnesota, Twin Cities",University of Minnesota
4775,University of Missouri - Columbia,University of Missouri
4776,University of Montana - Missoula,University of Montana
4448,University of Munich,University of Zurich
4879,University of Perugia,University of Georgia
4466,"University of Pittsburgh, Pittsburgh Campus",University of Pittsburgh
3961,University of Pittsburgh-Pittsburgh Campus,University of Pittsburgh
4193,Western University (The University of Western ...,University of Western Ontario

In [37]:
delete([4722,4749,4771,4674,4448,4879], shanghai_new, wrong_names_shanghai)

In [38]:
shanghai_new.drop([4722,4749,4771,4674,4448,4879], inplace=True)

In [39]:
shanghai_new[shanghai_new['score']==91][['university_name', 'university_name_normalized']]

                   university_name            university_name_normalized
2462  Royal Holloway, U. of London  Royal Holloway, University of London

In [40]:
shanghai_new[shanghai_new['score']==92][['university_name', 'university_name_normalized']]

                      university_name        university_name_normalized
4611  Ecole Normale Superieure - Lyon  École Normale Supérieure de Lyon
4867               University of Jena               University of Genoa
4583              University of Koeln                University of Kiel
4293         Vrije University Brussel        Vrije Universiteit Brussel

In [41]:
delete([4867,4583], shanghai_new, wrong_names_shanghai)

In [42]:
shanghai_new.drop([4867,4583], inplace=True)

In [43]:
shanghai_new[shanghai_new['score']==93][['university_name', 'university_name_normalized']]

                       university_name           university_name_normalized
4814          Eotvos Lorand University             Eötvös Loránd University
4026        University Libre Bruxelles        Université Libre de Bruxelles
4884  University of Roma - Tor Vergata  University of Rome II – Tor Vergata

In [44]:
shanghai_new[shanghai_new['score']==95][['university_name', 'university_name_normalized']]
#shanghai_new[shanghai_new['score']==95][['university_name', 'university_name_normalized']].head(60)
#shanghai_new[shanghai_new['score']==95][['university_name', 'university_name_normalized']].tail(30)

,university_name,university_name_normalized
3876,Arizona State University - Tempe,Arizona State University
4804,Brunel University,Brunel University London
4307,Capital University of Medical Sciences,Capital Medical University
4808,Catholic University of Chile,Pontifical Catholic University of Chile
4704,China Medical University,"China Medical University, Taiwan"
...,...,...
4595,University of Wuerzburg,University of Würzburg
4501,Université libre de Bruxelles (ULB),Université Libre de Bruxelles
4613,Vrije Universiteit Brussel (VUB),Vrije Universiteit Brussel
3309,Washington State University - Pullman,Washington State University
4693,Western University,Western Sydney University

In [45]:
delete([4693], shanghai_new, wrong_names_shanghai)

In [46]:
shanghai_new.drop([4693], inplace=True)

In [47]:
shanghai_new[shanghai_new['score']>=96][['university_name', 'university_name_normalized']].head(10)

,university_name,university_name_normalized
4697,Aalborg University,Aalborg University
4797,Aalto University,Aalto University
4469,Aarhus University,Aarhus University
3115,Aix-Marseille University,Aix-Marseille University
4798,Aristotle University of Thessaloniki,Aristotle University of Thessaloniki
4489,Arizona State University,Arizona State University
4799,Auburn University,Auburn University
4597,Autonomous University of Barcelona,Autonomous University of Barcelona
4598,Autonomous University of Madrid,Autonomous University of Madrid
902,Bangor University,Bangor University

At this point we did a duplicate analysis by defining a function called *duplicate_check*.

*duplicate_check* takes a table as input, then defines an empty list, called *li*, and a new DataFrame, called *duplicate*, to which it assigns the rows of the input table that have the value of the *university_name_normalized* field that is not null and duplicate. *duplicate_check* iterates through each normalized university name in the *duplicate* DataFrame and if it is not yet present in *li*, it appends it to *li*; finally, for each element of *li*, it prints the normalized university name and the corresponding *year* and *university_name* fields of the input table.

This procedure is used to study if the duplicates found are made up of the universities that have changed their name over time (in this case we delete the oldest data) or if they are a campus of the same university (if the name in the table is a campus and not the name of a university, it is deleted) or different universities.

In [48]:
def duplicate_check(table):
    li=[]
    duplicate=table[(table['university_name_normalized'].isnull()==False) & (table['university_name_normalized'].duplicated()==True)]
    for el in duplicate['university_name_normalized']:
        if el not in li:
            li.append(el)
    for i in range(0,len(li)):
        print(table[table['university_name_normalized'] == li[i]][['university_name','year', 'university_name_normalized']])

In [49]:
duplicate_check(shanghai_new)

               university_name  year university_name_normalized
3115  Aix-Marseille University  2011   Aix-Marseille University
4497  Aix Marseille University  2015   Aix-Marseille University
                       university_name  year university_name_normalized
4489          Arizona State University  2015   Arizona State University
3876  Arizona State University - Tempe  2013   Arizona State University
                             university_name  year  university_name_normalized
4806              Capital Medical University  2015  Capital Medical University
4307  Capital University of Medical Sciences  2014  Capital Medical University
                      university_name  year university_name_normalized
4606                Curtin University  2015          Curtin University
3425  Curtin University of Technology  2011          Curtin University
                                        university_name  year  \
4624           Louisiana State University - Baton Rouge  2015
925   Louisiana State University Health Sciences Center  2006

      university_name_normalized
4624  Louisiana State University
925   Louisiana State University
                university_name  year university_name_normalized
4405      University of Chicago  2015      University of Chicago
423   Loyola University Chicago  2005      University of Chicago
                 university_name  year university_name_normalized
4864          University of Graz  2015         University of Graz
4825  Medical University of Graz  2015         University of Graz
                      university_name  year university_name_normalized
4664          University of Innsbruck  2015    University of Innsbruck
3346  Medical University of Innsbruck  2011    University of Innsbruck
                 university_name  year university_name_normalized
4628          Nanjing University  2015         Nanjing University
4828  Nanjing Medical University  2015         Nanjing University
                  university_name  year university_name_normalized
4487        University of Arizona  2015      University of Arizona
438   Northern Arizona University  2005      University of Arizona
                                        university_name  year  \
3738     Norwegian University of Science and Technology  2012
4510  Norwegian University of Science and Technology...  2015

                          university_name_normalized
3738  Norwegian University of Science and Technology
4510  Norwegian University of Science and Technology
                                        university_name  year  \
4616  Indiana University-Purdue University at Indian...  2015
4458                 Purdue University - West Lafayette  2015

     university_name_normalized
4616          Purdue University
4458          Purdue University
                       university_name  year       university_name_normalized
4562   Queen Mary University of London  2015  Queen Mary University of London
3741          Queen Mary, U. of London  2012  Queen Mary University of London
4130  Queen Mary, University of London  2014  Queen Mary University of London
                        university_name  year  \
4621  KTH Royal Institute of Technology  2015
4133      Royal Institute of Technology  2014

             university_name_normalized
4621  KTH Royal Institute of Technology
4133  KTH Royal Institute of Technology
                                        university_name  year  \
2567        Rutgers, The State University of New Jersey  2010
4461  Rutgers, The State University of New Jersey - ...  2015

                       university_name_normalized
2567  Rutgers, the State University of New Jersey
4461  Rutgers, the State University of New Jersey
                             university_name  year university_name_normalized
4496                    Texas A&M University  2015       Texas A&M University
3994                  Texas A & M University  2014       Texas A&M University
3606  Texas A&M University - College Station  2012       Texas A&M University
                   university_name  year university_name_normalized
4412      Johns Hopkins University  2015   Johns Hopkins University
3913  The Johns Hopkins University  2014   Johns Hopkins University
                                  university_name  year  \
4768                    University of Connecticut  2015
3758       The University of Connecticut - Storrs  2012
3461  The University of Connecticut Health Center  2011

     university_name_normalized
4768  University of Connecticut
3758  University of Connecticut
3461  University of Connecticut
                  university_name  year university_name_normalized
3853      University of Melbourne  2013    University of Melbourne
4440  The University of Melbourne  2015    University of Melbourne
                        university_name  year     university_name_normalized
3654      University of New South Wales  2012  University of New South Wales
4518  The University of New South Wales  2015  University of New South Wales
                 university_name  year          university_name_normalized
3358  Sao Paulo State University  2011  São Paulo State University (UNESP)
4758                       UNESP  2015  São Paulo State University (UNESP)
                                        university_name  year  \
3362             State University of New York at Albany  2011
4759  University at Albany (State University of New ...  2015

               university_name_normalized
3362  State University of New York Albany
4759  State University of New York Albany
                          university_name  year university_name_normalized
4526             University of Birmingham  2015   University of Birmingham
4653  University of Alabama at Birmingham  2015   University of Birmingham
                             university_name  year university_name_normalized
4853  University of Arkansas at Fayetteville  2015     University of Arkansas
4854   University of Arkansas at Little Rock  2015     University of Arkansas
              university_name  year university_name_normalized
4802     Bielefeld University  2015       Bielefeld University
3382  University of Bielefeld  2011       Bielefeld University
               university_name  year university_name_normalized
4656    University of Bordeaux  2015     University of Bordeaux
3383  University of Bordeaux 1  2011     University of Bordeaux
                         university_name  year  \
4400  University of California, Berkeley  2015
3900   University of California-Berkeley  2014

              university_name_normalized
4400  University of California, Berkeley
3900  University of California, Berkeley
                   university_name  year    university_name_normalized
3748  State University of Campinas  2012  State University of Campinas
4764        University of Campinas  2015  State University of Campinas
                    university_name  year university_name_normalized
4479          University of Florida  2015      University of Florida
4765  University of Central Florida  2015      University of Florida
           university_name  year university_name_normalized
4610     Durham University  2015          Durham University
3775  University of Durham  2012          Durham University
           university_name  year university_name_normalized
4863   University of Genoa  2015        University of Genoa
4364  University of Genova  2014        University of Genoa
               university_name  year university_name_normalized
4442     Heidelberg University  2015      Heidelberg University
3852  University of Heidelberg  2013      Heidelberg University
                          university_name  year university_name_normalized
4665                 University of Kansas  2015       University of Kansas
3783      University of Kansas - Lawrence  2012       University of Kansas
2984  University of Kansas Medical Center  2010       University of Kansas
               university_name  year university_name_normalized
4625     Maastricht University  2015      Maastricht University
3790  University of Maastricht  2012      Maastricht University
                               university_name  year  \
4872  University of Maryland, Baltimore County  2015
4675         University of Maryland, Baltimore  2015

                    university_name_normalized
4872  University of Maryland, Baltimore County
4675  University of Maryland, Baltimore County
                                        university_name  year  \
4533                University of Massachusetts Amherst  2015
4534  University of Massachusetts Medical School - W...  2015

       university_name_normalized
4533  University of Massachusetts
4534  University of Massachusetts
                         university_name  year university_name_normalized
3820  University of Michigan - Ann Arbor  2013     University of Michigan
4418    University of Michigan-Ann Arbor  2015     University of Michigan
                           university_name  year university_name_normalized
4250  The University of Montana - Missoula  2014      University of Montana
4776      University of Montana - Missoula  2015      University of Montana
                  university_name  year university_name_normalized
4676    University of Montpellier  2015     Montpellier University
4174  University of Montpellier 2  2014     Montpellier University
                             university_name  year university_name_normalized
4733     Paris Dauphine University (Paris 9)  2015  Paris Dauphine University
4277  University of Paris Dauphine (Paris 9)  2014  Paris Dauphine University
                            university_name  year  \
4544     University Paris Diderot - Paris 7  2015
3655  University of Paris Diderot (Paris 7)  2012

              university_name_normalized
4544  Paris Diderot University – Paris 7
3655  Paris Diderot University – Paris 7
                                  university_name  year  \
3860                     University of Pittsburgh  2013
4466  University of Pittsburgh, Pittsburgh Campus  2015
3961   University of Pittsburgh-Pittsburgh Campus  2014

     university_name_normalized
3860   University of Pittsburgh
4466   University of Pittsburgh
3961   University of Pittsburgh
                 university_name  year university_name_normalized
4635     Pompeu Fabra University  2015    Pompeu Fabra University
4278  University of Pompeu Fabra  2014    Pompeu Fabra University
            university_name  year university_name_normalized
4888  University of Seville  2015      University of Seville
2501  University of Sevilla  2009      University of Seville
                          university_name  year     university_name_normalized
4026           University Libre Bruxelles  2014  Université Libre de Bruxelles
4501  Université libre de Bruxelles (ULB)  2015  Université Libre de Bruxelles
                       university_name  year university_name_normalized
4542            University of Virginia  2015     University of Virginia
4596  Virginia Commonwealth University  2015     University of Virginia

1508          West Virginia University  2007     University of Virginia
                       university_name  year  university_name_normalized
4613  Vrije Universiteit Brussel (VUB)  2015  Vrije Universiteit Brussel
4293          Vrije University Brussel  2014  Vrije Universiteit Brussel
                            university_name  year   university_name_normalized
4793            Washington State University  2015  Washington State University
3309  Washington State University - Pullman  2011  Washington State University

In [50]:
delete([3115,3876,4307,3425,925,423,4825,3346,4828,438,3738,4616,3741,4130,4133,2567,3606,3994,3913,3758,3461,3853,3654,3358,3362,4653,4854,3382,3383,3900,3748,4765,3775,4364,3852,3783,2984,3790,4675,4534,3820,4250,4174,4277,3655,3860,3961,4278,2501,4026,4596,1508,4293,3309], shanghai_new, wrong_names_shanghai)

In [51]:
shanghai_new.drop([3115,3876,4307,3425,925,423,4825,3346,4828,438,3738,4616,3741,4130,4133,2567,3606,3994,3913,3758,3461,3853,3654,3358,3362,4653,4854,3382,3383,3900,3748,4765,3775,4364,3852,3783,2984,3790,4675,4534,3820,4250,4174,4277,3655,3860,3961,4278,2501,4026,4596,1508,4293,3309], inplace=True)

In [52]:
duplicate_check(shanghai_new)

In the case of the *times_new* DataFrame, the *perfect_match* function directly solved the problem of the wrong university names, so it was not necessary to use *complete_procedure* and carry out the subsequent manual analysis.

In [53]:
#times_new=complete_procedure(times_new)
times_new['university_name_normalized']=times_new['university_name'].apply(perfect_match)
times_new.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,university_name_normalized
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,AGH University of Science and Technology
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,Aalborg University
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,Aalto University
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,Aarhus University
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,Aberystwyth University

In [54]:
duplicate_check(times_new)

For the *cwur_new* DataFrame we repeated the same analysis carried out for *shanghai_new*.

In [55]:
cwur_new=complete_procedure(cwur_new)
cwur_new.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,university_name_normalized
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,100,2015,AGH University of Science and Technology
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,100,2015,Aalborg University
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,100,2015,Aalto University
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,100,2015,Aarhus University
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,100,2015,Aberystwyth University

In [56]:
cwur_new[cwur_new['score']<=88].head(10)[['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
2164,Ain Shams University,"University of California, Berkeley"
1849,Albany Medical College,"University of Maryland, College Park"
2050,"All India Institute of Medical Sciences, New D...",University of Cambridge
1924,Ankara University,Andhra University
1878,Banaras Hindu University,Yale University
1320,Baylor College of Medicine,ETH Zurich – Swiss Federal Institute of Techno...
1766,Baylor University,Bangor University
1904,Beihang University,"University of California, Berkeley"
1159,Beijing Jiaotong University,Harvard University
1595,Beijing Normal University,Yale University

In [57]:
delete(cwur_new.index[cwur_new['score']<=88], cwur_new, wrong_names_cwur)

In [58]:
cwur_new.drop(cwur_new.index[cwur_new['score']<=88], inplace=True)

In [59]:
cwur_new[cwur_new['score']==89][['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
1573,Darmstadt University of Technology,Warsaw University of Technology
1409,Dresden University of Technology,Brno University of Technology
2197,Federal University of Ceará,Federal University of Lavras
2026,Nagoya Institute of Technology,Georgia Institute of Technology
1746,Nara Institute of Science and Technology,Gwangju Institute of Science and Technology
1911,San Francisco State University,University of San Francisco
1187,Shanxi University,Shanghai University
2162,Southern Medical University,Southern Federal University
1761,University Lille 1: Sciences and Technologies,Lille 1 University – Science and Technology
2121,University of Basilicata,University of Brasília
2099,University of Fukui,University of Turku
1962,University of Hyogo,University of Otago
1497,University of Louisville,University of Seville
1940,University of Mons,University of Bonn
1892,University of Málaga,University of Milan
2000,University of Oldenburg,University of Gothenburg
1701,University of Sherbrooke,Université de Sherbrooke
1699,University of Udine,University of Turin

In [60]:
delete(cwur_new.index[(cwur_new['score']==89) & (cwur_new['university_name']!='University of Sherbrooke') & (cwur_new['university_name'] != 'University Lille 1: Sciences and Technologies')], cwur_new, wrong_names_cwur)

In [61]:
cwur_new.drop(cwur_new.index[(cwur_new['score']==89) & (cwur_new['university_name']!='University of Sherbrooke') & (cwur_new['university_name'] != 'University Lille 1: Sciences and Technologies')], inplace=True)

In [62]:
cwur_new[cwur_new['score']==90][['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
1354,Albert Ludwig University of Freiburg,University of Freiburg
1846,Binghamton University,"Binghamton University, State University of New..."
1470,Colorado State University - Fort Collins,Colorado State University
2082,Hefei University of Technology,Delft University of Technology
1305,Indiana University - Bloomington,Indiana University
1363,Indiana University-Purdue University Indianapolis,Purdue University
2154,Jinan University,Inha University
1434,Julius-Maximilian's University of Würzburg,University of Würzburg
1903,King Abdullah University of Science and Techno...,AGH University of Science and Technology
1970,Kurume University,Umeå University
1478,London School of Economics,London School of Economics and Political Science
1531,Louisiana State University - Baton Rouge,Louisiana State University
1824,Louisiana Tech University,Louisiana State University
2094,Nanjing University of Aeronautics and Astronau...,Nanjing University
2009,Nanjing University of Technology,Nanjing University
2167,National University of Colombia,National University of Córdoba
1246,"Pennsylvania State University, University Park",Pennsylvania State University
1242,"Purdue University, West Lafayette",Purdue University
2073,"Royal Veterinary College, University of London",Royal Veterinary College
1972,Saga University,Osaka University
2130,Shahid Beheshti University of Medical Sciences,Shahid Beheshti University
1301,"Texas A&M University, College Station",Texas A&M University
2109,Trent University,Nottingham Trent University
1472,"University at Buffalo, The State University of...",University at Buffalo
1742,University of Akron,University of Arizona
2058,University of Angers,University of Nantes
1749,University of Arkansas - Fayetteville,University of Arkansas
1628,University of Arkansas for Medical Sciences,University of Arkansas
1872,University of Girona,University of Regina
1545,University of Marburg,University of Würzburg
1382,University of Massachusetts Medical School,University of Massachusetts
1889,University of Messina,University of Siena
1218,"University of Michigan, Ann Arbor",University of Michigan
1247,"University of Minnesota, Twin Cities",University of Minnesota
1753,University of Missouri–Kansas City,University of Missouri
1784,University of Montana - Missoula,University of Montana
1549,University of Oklahoma - Norman Campus,University of Oklahoma
1675,University of Oklahoma Health Sciences Center,University of Oklahoma
2078,University of Orléans,University of Jordan
1543,University of Perugia,University of Georgia
1245,University of Pittsburgh - Pittsburgh Campus,University of Pittsburgh
2163,University of Silesia,University of Siena
1332,Western University (The University of Western ...,University of Western Ontario
2183,Zhejiang University of Technology,Zhejiang University
1980,École Polytechnique de Montréal,École Polytechnique

In [63]:
delete([2082,2154,1903,1970,2167,1972,2109,1742,2058,1872,1545,1889,2078,1543,2163,1980], cwur_new, wrong_names_cwur)

In [64]:
cwur_new.drop([2082,2154,1903,1970,2167,1972,2109,1742,2058,1872,1545,1889,2078,1543,2163,1980], inplace=True)

In [65]:
cwur_new[cwur_new['score']==91][['university_name', 'university_name_normalized']]

                         university_name         university_name_normalized
1936                   Kindai University                   Kinki University
1809          Putra University, Malaysia          Universiti Putra Malaysia
2044                    Sofia University                  Sophia University
2123       South China Normal University       East China Normal University
1944              University of Calabria             University of Cagliari
1908             University of Cantabria              University of Catania
1851  University of Los Andes (Colombia)  University of the Andes, Colombia

In [66]:
delete([2123,1944,1908], cwur_new, wrong_names_cwur)

In [67]:
cwur_new.drop([2123,1944,1908], inplace=True)

In [68]:
cwur_new[cwur_new['score']==92][['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
1219,Swiss Federal Institute of Technology in Zurich,ETH Zurich – Swiss Federal Institute of Techno...
2134,University of Jaén,University of Jordan
1527,University of Jena,University of Genoa
2112,University of North Dakota,University of South Dakota
2056,University of Siegen,University of Siena
2143,Wrocław University of Technology,Warsaw University of Technology

In [69]:
delete([2134,1527,2112,2056,2143], cwur_new, wrong_names_cwur)

In [70]:
cwur_new.drop([2134,1527,2112,2056,2143], inplace=True)

In [71]:
cwur_new[cwur_new['score']==93][['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
2173,Federal University of Santa Maria,Federal University of Santa Catarina
2086,Kyoto Institute of Technology,Tokyo Institute of Technology
1979,Mie University,Umeå University
2003,Nanjing University of Science and Technology,AGH University of Science and Technology
2139,University of Almería,University of Alberta

In [72]:
delete([2173,2086,1979,2003,2139], cwur_new, wrong_names_cwur)

In [73]:
cwur_new.drop([2173,2086,1979,2003,2139], inplace=True)

In [74]:
cwur_new[cwur_new['score']==94][['university_name', 'university_name_normalized']]

      university_name university_name_normalized
1926  Toho University          Tohoku University

In [75]:
delete([1926], cwur_new, wrong_names_cwur)

In [76]:
cwur_new.drop([1926], inplace=True)

In [77]:
cwur_new[cwur_new['score']==95][['university_name', 'university_name_normalized']]
#cwur_new[cwur_new['score']==95].head(60)[['university_name', 'university_name_normalized']]
#cwur_new[cwur_new['score']==95].tail(10)[['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
2089,Adam Mickiewicz University in Poznań,Adam Mickiewicz University
2176,Beijing University of Technology,University of Science and Technology Beijing
1671,Brunel University,Brunel University London
2005,Chungbuk National University,Chonbuk National University
2133,Federal University of Paraná,Federal University of Paraná (UFPR)
...,...,...
2081,University of Western Sydney,University of Sydney
1579,"Washington State University, Pullman",Washington State University
1190,Zhejiang Normal University,Zhejiang University
1236,École normale supérieure - Paris,École Normale Supérieure
1920,École normale supérieure de Cachan,École Normale Supérieure

In [78]:
delete([1902], cwur_new, wrong_names_cwur)

In [79]:
cwur_new.drop([1902], inplace=True)

In [80]:
cwur_new[cwur_new['score']>=96][['university_name', 'university_name_normalized']]

,university_name,university_name_normalized
1981,AGH University of Science and Technology,AGH University of Science and Technology
1764,Aalborg University,Aalborg University
1620,Aalto University,Aalto University
1321,Aarhus University,Aarhus University
2013,Aberystwyth University,Aberystwyth University
...,...,...
1362,Université libre de Bruxelles,Université Libre de Bruxelles
1475,Wageningen University and Research Centre,Wageningen University and Research Center
1251,Washington University in St. Louis,Washington University in St Louis
1588,Xi'an Jiaotong University,Xi’an Jiaotong University
1670,École normale supérieure de Lyon,École Normale Supérieure de Lyon

In [81]:
duplicate_check(cwur_new)

                                   university_name  year  \
1729  University of Science and Technology Beijing  2015
2176              Beijing University of Technology  2015

                        university_name_normalized
1729  University of Science and Technology Beijing
2176  University of Science and Technology Beijing
                   university_name  year   university_name_normalized
1621   Chonbuk National University  2015  Chonbuk National University
2005  Chungbuk National University  2015  Chonbuk National University
                      university_name  year university_name_normalized
1331          University of São Paulo  2015    University of São Paulo
1788  Federal University of São Paulo  2015    University of São Paulo
              university_name  year university_name_normalized
1752         Hunan University  2015           Hunan University
2171  Hunan Normal University  2015           Hunan University
                               university_name  year  \
1531  Louisiana State University - Baton Rouge  2015
1824                 Louisiana Tech University  2015

      university_name_normalized
1531  Louisiana State University
1824  Louisiana State University
                 university_name  year university_name_normalized
1783          University of Graz  2015         University of Graz
1773  Medical University of Graz  2015         University of Graz
             university_name  year university_name_normalized
1324       Nagoya University  2015          Nagoya University
1798  Nagoya City University  2015          Nagoya University
                                        university_name  year  \
1443                                 Nanjing University  2015
2085                         Nanjing Medical University  2015
2063                          Nanjing Normal University  2015
2094  Nanjing University of Aeronautics and Astronau...  2015
2009                   Nanjing University of Technology  2015

     university_name_normalized
1443         Nanjing University
2085         Nanjing University
2063         Nanjing University
2094         Nanjing University
2009         Nanjing University
                      university_name  year university_name_normalized
1474          Northeastern University  2015    Northeastern University
2070  Northeastern University (China)  2015    Northeastern University
                                        university_name  year  \
1363  Indiana University-Purdue University Indianapolis  2015
1242                  Purdue University, West Lafayette  2015

     university_name_normalized
1363          Purdue University
1242          Purdue University
                 university_name  year university_name_normalized
2108          Saitama University  2015         Saitama University
1997  Saitama Medical University  2015         Saitama University
                 university_name  year university_name_normalized
1883         Shanghai University  2015        Shanghai University
2087  Shanghai Normal University  2015        Shanghai University
                          university_name  year     university_name_normalized
1826        China Agricultural University  2015  China Agricultural University
2168  South China Agricultural University  2015  China Agricultural University
                 university_name  year university_name_normalized
1530          Tianjin University  2015         Tianjin University
2175  Tianjin Medical University  2015         Tianjin University
                          university_name  year university_name_normalized
1351             University of Birmingham  2015   University of Birmingham
1345  University of Alabama at Birmingham  2015   University of Birmingham
                                  university_name  year  \
1749        University of Arkansas - Fayetteville  2015
1628  University of Arkansas for Medical Sciences  2015

     university_name_normalized
1749     University of Arkansas
1628     University of Arkansas
                university_name  year university_name_normalized
1498     University of Bordeaux  2015     University of Bordeaux
631    University of Bordeaux I  2014     University of Bordeaux
602   University of Bordeaux II  2014     University of Bordeaux
                    university_name  year university_name_normalized
1259          University of Florida  2015      University of Florida
1593  University of Central Florida  2015      University of Florida
                               university_name  year  \
1692  University of Maryland, Baltimore County  2015
1374         University of Maryland, Baltimore  2015

                    university_name_normalized
1692  University of Maryland, Baltimore County
1374  University of Maryland, Baltimore County
                                 university_name  year  \
1418         University of Massachusetts Amherst  2015
2024          University of Massachusetts Boston  2015
2083          University of Massachusetts Lowell  2015
1382  University of Massachusetts Medical School  2015

       university_name_normalized
1418  University of Massachusetts
2024  University of Massachusetts
2083  University of Massachusetts
1382  University of Massachusetts
                         university_name  year university_name_normalized
1393     University of Missouri–Columbia  2015     University of Missouri
1753  University of Missouri–Kansas City  2015     University of Missouri
1947    University of Missouri–St. Louis  2015     University of Missouri
                  university_name  year university_name_normalized
1423    University of Montpellier  2015     Montpellier University
725   University of Montpellier 1  2014     Montpellier University
440   University of Montpellier 2  2014     Montpellier University
                                    university_name  year  \
1549         University of Oklahoma - Norman Campus  2015
1675  University of Oklahoma Health Sciences Center  2015

     university_name_normalized
1549     University of Oklahoma
1675     University of Oklahoma
                       university_name  year university_name_normalized
1350            University of Montreal  2015     University of Montreal
1862  University of Québec at Montreal  2015     University of Montreal
                   university_name  year university_name_normalized
1287          University of Sydney  2015       University of Sydney
2081  University of Western Sydney  2015       University of Sydney
                        university_name  year university_name_normalized
1390                Zhejiang University  2015        Zhejiang University
1190         Zhejiang Normal University  2014        Zhejiang University
2183  Zhejiang University of Technology  2015        Zhejiang University
                         university_name  year university_name_normalized
1236    École normale supérieure - Paris  2015   École Normale Supérieure
1920  École normale supérieure de Cachan  2015   École Normale Supérieure

In [82]:
delete([2176,2005,1788,2171,1824,1773,1798,2085,2063,2094,2009,2070,1363,1997,2087,2168,2175,1345,1628,631,602,1593,1374,2024,2083,1382,1753,1947,725,440,1675,1862,2081,1190,2183,1920], cwur_new, wrong_names_cwur)

In [83]:
cwur_new.drop([2176,2005,1788,2171,1824,1773,1798,2085,2063,2094,2009,2070,1363,1997,2087,2168,2175,1345,1628,631,602,1593,1374,2024,2083,1382,1753,1947,725,440,1675,1862,2081,1190,2183,1920], inplace=True)

In [84]:
duplicate_check(cwur_new)

After normalizing the university names in all three DataFrames, we use the `merge` function to get a single DataFrame with all the data.

In [85]:
all_ranking_partial = pd.merge(shanghai_new, times_new, on = 'university_name_normalized', suffixes=('_shanghai', '_times'))
all_ranking_partial

,world_rank_shanghai,university_name_shanghai,national_rank,total_score_shanghai,alumni,award,hici,ns,pub,pcp,...,international,research,citations,income,total_score_times,num_students,student_staff_ratio,international_students,female_male_ratio,year_times
0,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,...,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
1,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,...,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
2,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,...,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
3,401-500,Aristotle University of Thessaloniki,2,NaN,0.0,0.0,4.9,1.5,34.0,16.8,...,36.6,15.0,29.5,33.6,-,"46,288",22.2,9%,52 : 48,2016
4,93,Arizona State University,47,24.5,0.0,20.0,22.2,25.5,42.6,19.1,...,31.9,38.1,84.6,32.0,49.7,"83,236",29.9,9%,50 : 50,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
491,101-150,Université libre de Bruxelles (ULB),3,NaN,19.9,26.6,11.3,11.8,32.7,30.4,...,84.5,28.3,47.9,39.1,-,"23,819",26.1,32%,54 : 46,2016
492,201-300,Vrije Universiteit Brussel (VUB),5-6,NaN,13.6,0.0,5.0,10.0,31.3,26.9,...,64.5,24.5,56.8,77.1,-,"9,020",17.1,16%,55 : 45,2016
493,32,Washington University in St. Louis,24,37.4,22.9,24.9,40.7,41.8,50.5,26.0,...,44.9,55.6,99.2,33.5,67.0,"12,528",5.7,17%,NaN,2016
494,201-300,Western University (The University of Western ...,8-16,NaN,0.0,0.0,5.1,15.0,41.9,18.0,...,73.6,32.4,59.0,59.7,-,"27,387",20.7,16%,54 : 46,2016
495,201-300,Xian Jiao Tong University,8-13,NaN,0.0,0.0,8.7,7.7,50.1,18.9,...,25.8,22.5,25.5,70.4,-,"29,863",12.3,4%,34 : 66,2016

In [86]:
all_ranking = pd.merge(all_ranking_partial, cwur_new, on = 'university_name_normalized')[["university_name_normalized", "world_rank_times", "world_rank_shanghai", "world_rank"]]
all_ranking.head()

,university_name_normalized,world_rank_times,world_rank_shanghai,world_rank
0,Aalborg University,201-250,301-400,565
1,Aalto University,251-300,401-500,421
2,Aarhus University,=106,73,122
3,Aristotle University of Thessaloniki,601-800,401-500,459
4,Arizona State University,189,93,97

In some cases, the scores assigned to universities are expressed as intervals. To handle these cases, we use regular expressions and define the *average_value* function.

*average_value* takes a string as input (the string represents the score of each university). If the score is made up of a certain number of digits, followed by a character other than a digit and subsequently by other digits, it means that it is an interval and in this case the function returns its average value, which we consider as score. In the cases where the score is composed only of digits or of a single group of digits followed or preceded by symbols, the function returns the digits, which we will use as score.

In [87]:
interval=re.compile('(?P<num1>\d*)(\D*)(?P<num2>\d*)')

def average_value(string):
    expression=interval.search(string)
    num1=expression.group('num1')
    num2=expression.group('num2')
    if (num1!='') and (num2!=''):
        return (int(num1)+int(num2))/2
    else:
        if num1!='':
            return int(num1)
        if num2!='':
            return int(num2)
        return np.NaN

To complete the exercise, we define the *max_difference* variable as the difference between the maximum score and the minimum score between the three scores assigned for each university by the three different rankings. To do this we use the `zip()` function to aggregate the *world_rank* fields of each of the three rankings. To the rankings in which some scores were expressed as an interval (*shanghai* and *times*) we apply the *average_value* function defined previously. We therefore create a new field within the *all_ranking* table called *max_difference*, which contains the differences calculated as just explained. These differences were then rounded to the nearest major integer, using the `ceil` function of `math` library.

In [88]:
max_difference=[max(a,b,c)-min(a,b,c) for (a,b,c) in zip(all_ranking['world_rank'], all_ranking['world_rank_shanghai'].apply(average_value), all_ranking['world_rank_times'].apply(average_value))]
all_ranking['max_difference']=max_difference
all_ranking['max_difference']=all_ranking['max_difference'].apply(math.ceil)
all_ranking

,university_name_normalized,world_rank_times,world_rank_shanghai,world_rank,max_difference
0,Aalborg University,201-250,301-400,565,340
1,Aalto University,251-300,401-500,421,175
2,Aarhus University,=106,73,122,49
3,Aristotle University of Thessaloniki,601-800,401-500,459,250
4,Arizona State University,189,93,97,96
...,...,...,...,...,...
483,Université Libre de Bruxelles,351-400,101-150,163,250
484,Vrije Universiteit Brussel,301-350,201-300,280,75
485,Washington University in St Louis,=60,32,52,28
486,University of Western Ontario,201-250,201-300,133,118
487,Xi’an Jiaotong University,501-600,201-300,389,300

### 5. Consider only the most recent data point of the *times* dataset. Compute the number of male and female students for each country.

In the *times_most* dataset we can find the `female_male_ratio` column which shows the number of females and the number of males, separated by the symbol `:`.
We create two new columns in the *times_most* dataset by splitting the `famale_male_ratio` column in order to obtain the percentage of females and the percentage of males for each row.

In [89]:
times_most[['percentage_of_females','percentage_of_males']]=(times_most.female_male_ratio.str.split(" : ",expand=True))
times_most['percentage_of_females']=pd.to_numeric(times_most['percentage_of_females'], errors='coerce') # errors='coerce' means that invalid parsing will be set as NaN.
times_most['percentage_of_males']=pd.to_numeric(times_most['percentage_of_males'], errors='coerce')
times_most['percentage_of_females']=(times_most['percentage_of_females'])/100
times_most['percentage_of_males']=(times_most['percentage_of_males'])/100
times_most.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,university_name_normalized,percentage_of_females,percentage_of_males
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,AGH University of Science and Technology,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,Aalborg University,0.48,0.52
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,Aalto University,0.32,0.68
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,Aarhus University,0.54,0.46
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,Aberystwyth University,0.48,0.52

In [90]:
max_difference=[max(a,b,c)-min(a,b,c) for (a,b,c) in zip(all_ranking['world_rank'], all_ranking['world_rank_shanghai'].apply(average_value), all_ranking['world_rank_times'].apply(average_value))]
all_ranking['max_difference']=max_difference
all_ranking['max_difference']=all_ranking['max_difference'].apply(math.ceil)
all_ranking

,university_name_normalized,world_rank_times,world_rank_shanghai,world_rank,max_difference
0,Aalborg University,201-250,301-400,565,340
1,Aalto University,251-300,401-500,421,175
2,Aarhus University,=106,73,122,49
3,Aristotle University of Thessaloniki,601-800,401-500,459,250
4,Arizona State University,189,93,97,96
...,...,...,...,...,...
483,Université Libre de Bruxelles,351-400,101-150,163,250
484,Vrije Universiteit Brussel,301-350,201-300,280,75
485,Washington University in St Louis,=60,32,52,28
486,University of Western Ontario,201-250,201-300,133,118
487,Xi’an Jiaotong University,501-600,201-300,389,300

To get the total numbers of girls and boys from their percentages we need the total number of students. The latter is expressed separating the thousands with a comma, which we remove.

In [91]:
times_most['num_students']=times_most['num_students'].str.replace(',', '')
times_most['num_students']=pd.to_numeric(times_most['num_students'], errors = 'coerce')
times_most.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,university_name_normalized,percentage_of_females,percentage_of_males
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,17.0,1%,-,2016,AGH University of Science and Technology,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,Aalborg University,0.48,0.52
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,Aalto University,0.32,0.68
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,Aarhus University,0.54,0.46
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,Aberystwyth University,0.48,0.52

We add the *females* and *males* fields to the *times_most* DataFrame, multiplying the total number of students by the percentage of females and males respectively.

In [92]:
times_most['females']=round((times_most['num_students'])*(times_most['percentage_of_females']))
times_most['males']=round((times_most['num_students'])*(times_most['percentage_of_males']))
times_most.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,university_name_normalized,percentage_of_females,percentage_of_males,females,males
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,17.0,1%,-,2016,AGH University of Science and Technology,NaN,NaN,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,Aalborg University,0.48,0.52,8363.0,9059.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,Aalto University,0.32,0.68,5152.0,10947.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,Aarhus University,0.54,0.46,12903.0,10992.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,Aberystwyth University,0.48,0.52,4441.0,4811.0

We define the DataFrame *total_students* which contains, for each country, the total number of females, the total number of males and the total number of students, obtained as the sum of the first two.

In [93]:
total_students=pd.DataFrame(times_most.groupby('country')['females'].sum())
total_students['males']=pd.DataFrame(times_most.groupby('country')['males'].sum())
total_students['total_students']=(total_students['females'])+(total_students['males'])
total_students.head()

             females     males  total_students
country
Argentina    67191.0   41182.0        108373.0
Australia   391736.0  321640.0        713376.0
Austria      68364.0   66113.0        134477.0
Bangladesh   21323.0   41393.0         62716.0
Belarus      20219.0    9084.0         29303.0

### 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

We exclude from the calculation of the ratio the universities in which the number of men is equal to 0, because they would make the ratio infinite.
The problem is actually represented by a single university, *Ewha Womans University* which, as a university accessible only to women, is not a representative case within a study of the ratio *(number of females)* over *(number of males)* within each institution.

In [94]:
times_most['female_male_ratio']=(times_most['females'] / times_most[times_most['males']!=0]['males']).round(decimals=2)
times_most.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,university_name_normalized,percentage_of_females,percentage_of_males,females,males
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,17.0,1%,NaN,2016,AGH University of Science and Technology,NaN,NaN,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,0.92,2016,Aalborg University,0.48,0.52,8363.0,9059.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,0.47,2016,Aalto University,0.32,0.68,5152.0,10947.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,1.17,2016,Aarhus University,0.54,0.46,12903.0,10992.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,0.92,2016,Aberystwyth University,0.48,0.52,4441.0,4811.0

We check that the university with the highest ratio *(number of females)* over *(number of males)* has finite ratio:

In [95]:
times_most.loc[times_most['female_male_ratio'].idxmax()]['female_male_ratio']

3.55

We create a DataFrame containing only the required universities: those that have the ratio *(number of females)* over *(number of males)* lower than the average ratio.

In [96]:
mean_ratio=round(times_most['female_male_ratio'].mean(),2)
below_avg_ratio=pd.DataFrame(times_most[times_most['female_male_ratio'] < mean_ratio][['university_name','country','num_students','female_male_ratio']])
below_avg_ratio

,university_name,country,num_students,female_male_ratio
2003,Aalborg University,Denmark,17422.0,0.92
2056,Aalto University,Finland,16099.0,0.47
2105,Aberystwyth University,United Kingdom,9252.0,0.92
2406,Ajou University,South Korea,12706.0,0.49
2408,Alexandria University,Egypt,127431.0,0.85
...,...,...,...,...
2104,Zhejiang University,China,47508.0,0.69
1856,École Normale Supérieure,France,2400.0,0.85
2013,École Normale Supérieure de Lyon,France,2218.0,0.96
1904,École Polytechnique,France,2429.0,0.22
1833,École Polytechnique Fédérale de Lausanne,Switzerland,9666.0,0.37

One last check: the university in the DataFrame *below_avg_ratio* with maximum ratio must have a ratio lower than the average ratio.

In [97]:
(below_avg_ratio.loc[below_avg_ratio['female_male_ratio'].idxmax()]['female_male_ratio'])<mean_ratio

True

### 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

We create a DataFrame called *below_avg_country* to which, for each country, we add the total number of students belonging to universities which have the ratio between the number of females and the number of males below the average.

In [98]:
below_avg_country=pd.DataFrame(below_avg_ratio.groupby('country')['num_students'].sum())
below_avg_country.rename(columns={'num_students':'students_uni_below_avg'}, inplace=True)
below_avg_country.head()

            students_uni_below_avg
country
Australia                 146235.0
Austria                    61033.0
Bangladesh                 62716.0
Brazil                    278774.0
Canada                     86779.0

We create a DataFrame called *below_over_total* using the `merge` function on the *below_avg_country* and *total_students* DataFrames (of which we only consider the column *total_students*). We add a field called *ratio* to the DataFrame just defined, calculating the required ratio.

In [99]:
below_over_total=pd.merge(below_avg_country,total_students['total_students'], on='country')
below_over_total['ratio']=round(below_over_total['students_uni_below_avg']/below_over_total['total_students'],2)
below_over_total.head()

            students_uni_below_avg  total_students  ratio
country
Australia                 146235.0        713376.0   0.20
Austria                    61033.0        134477.0   0.45
Bangladesh                 62716.0         62716.0   1.00
Brazil                    278774.0        494251.0   0.56
Canada                     86779.0        623628.0   0.14

### 8. Read the file `educational_attainment_supplementary_data.csv`, discarding any row without `country_name` or `series_name`

In [100]:
edu_attainment=pd.read_csv('educational_attainment_supplementary_data.csv')
edu_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

We check if there are rows where `country_name` or `series_name` are empty fields:

In [101]:
edu_attainment[(edu_attainment['country_name'].isnull()==True) | (edu_attainment['series_name'].isnull()==True)]

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
79050,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79051,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79052,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79053,Data from database: Education Statistics: Educ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79054,Last Updated: 10/20/2015,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

We remove the rows in which `country_nam` or `series_name` do not contain any values.

In [102]:
edu_attainment.dropna(subset=['country_name', 'series_name'], inplace=True)
edu_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

We repeat the previous check to see if the wanted rows have actually been removed:

In [103]:
edu_attainment[(edu_attainment['country_name'].isnull()==True) | (edu_attainment['series_name'].isnull()==True)]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

[0 rows x 29 columns]

### 9. From `attainment` build a dataframe with the same data, but with 4 columns: `country_name`, `series_name`, `year`, `value`

To get the required DataFrame we use the `melt` function from `pandas`. We give the DataFrame *edu_attainment* that we want to have in the long format, the two columns we want to use for the identifying variables (*country_name* and *series_name*) and the name of the identifier column (*year*) as inputs to `melt`.

In [104]:
edu_attainment_long=pd.melt(edu_attainment, id_vars=['country_name', 'series_name'], var_name='year')
edu_attainment_long

,country_name,series_name,year,value
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.33
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,1.03
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.83
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,2.34
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.54
...,...,...,...,...
2134345,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134346,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134347,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134348,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134349,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

**Problem regarding the normalization of the university names**: in exercise 4 we used sub-tables containing only the most recent data, but in this case we have to normalize the total DataFrame and the *complete_procedure* function used before does not give correct results.
We have therefore defined the *final_complete_procedure* function, which takes two elements as input: a table and a list of errors.

*final_complete_procedure*:
* deletes from the table provided in input all the rows that have the *university_name* field empty;
* creates a new column called *university_name_normalized* in the input table by applying the *perfect_match* function to the *university_name* field;
* creates the *good* DataFrame with the rows that have a non-null result of the previous *perfect_match* application and creates the *dirty* table with the rows resulting in a null *university_name_normalized*;
* for each *university_name* of the *dirty table*, if this is present in the list of errors provided in input, deletes the corresponding row from *dirty*;
* creates a new field in the *dirty* table, called *university_name_normalized*, applying the *name_normalized* function to the *university_name* field of the same table;
* creates an empty list called *find* and appends each *university_name* of the *dirty* table to that list;
* iterates through all the *university_name* of the *good* table and if they match a key of the dictionary *special_cases* (created thanks to the previous analysis), it assigns the value associated with that key to the *search* variable. If the value of *search* is contained in the *find* list, the university with the corresponding name is removed from the *good* table;
* creates an empty list called *save* and appends each *university_name* from the *good* table to that list;
* iterates through all the *university_name* of the *dirty* table and removes from *dirty* those that are also present in the *save* list;
* returns the DataFrame obtained by the concatenation of *good* and *dirty*.

In [105]:
special_cases={'Aix-Marseille University':'Aix Marseille University',
     'Norwegian University of Science and Technology':'Norwegian University of Science and Technology - NTNU',
     'State University of Campinas':'University of Campinas',
     'University of Melbourne':'The University of Melbourne',
     'University of New South Wales':'The University of New South Wales',
     'University of Pittsburgh':'University of Pittsburgh, Pittsburgh Campus'}

In [106]:
def final_complete_procedure(table, wrong_names_list):
    table.drop(table.index[table['university_name'].isnull()==True], inplace=True)
    table['university_name_normalized'] = table['university_name'].apply(perfect_match)
    good=table[table['university_name_normalized'].isnull()==False].copy()
    #good['score']=100
    dirty=table[table['university_name_normalized'].isnull()==True].copy()
    for uni in dirty['university_name']:
        if uni in wrong_names_list:
            dirty.drop(dirty.index[dirty['university_name']==uni], inplace=True)
    dirty['university_name_normalized'] = dirty['university_name'].apply(name_normalized)
    #dirty['score'] = dirty['university_name'].apply(score_match)
    find=[]
    for uni in dirty['university_name']:
        find.append(uni)
    for uni in good['university_name']:
        if uni in special_cases:
            search=special_cases[uni]
            if search in find:
                good.drop(good.index[good['university_name']==uni], inplace=True)
    save=[]
    for uni in good['university_name_normalized']:
        save.append(uni)
    for uni in dirty['university_name_normalized']:
        if uni in save:
            dirty.drop(dirty.index[dirty['university_name_normalized']==uni], inplace=True)
    return(pd.concat([good, dirty]))

We proceed with the normalization of the university names in the three different DataFrames, applying the *final_complete_procedure* function.

In [107]:
#final_complete_procedure(shanghai_new, wrong_names_shanghai)
#final_complete_procedure(cwur_new, wrong_names_cwur)
#final_complete_procedure(times_new, [])

In [108]:
list_shanghai=final_complete_procedure(shanghai, wrong_names_shanghai)

In [109]:
list_shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,university_name_normalized
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005,Harvard University
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005,University of Cambridge
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005,Stanford University
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005,"University of California, Berkeley"
5,6,California Institute of Technology,5,67.1,59.2,68.6,59.8,65.8,52.5,100.0,2005,California Institute of Technology

In [110]:
copy_cwur=cwur.rename(columns={'institution': 'university_name'})

In [111]:
copy_cwur.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [112]:
list_cwur=final_complete_procedure(copy_cwur, wrong_names_cwur)

In [113]:
list_cwur.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,university_name_normalized
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,Harvard University
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,Massachusetts Institute of Technology
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,Stanford University
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,University of Cambridge
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,California Institute of Technology

In [114]:
wrong_names_times=[]

In [115]:
list_times=final_complete_procedure(times, wrong_names_times)

In [116]:
list_times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,university_name_normalized
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011,Harvard University
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011,California Institute of Technology
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011,Massachusetts Institute of Technology
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011,Stanford University
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011,Princeton University

We create a list for each of the three DataFrames that we have just normalized with the names of the universities without repetition and a total list, sum of the three lists.

In [117]:
unique_cwur=list(list_cwur['university_name_normalized'].unique())
unique_times=list(list_times['university_name_normalized'].unique())
unique_shanghai=list(list_shanghai['university_name_normalized'].unique())
total_list=unique_cwur+unique_times+unique_shanghai
total_list

['Harvard University',
 'Massachusetts Institute of Technology',
 'Stanford University',
 'University of Cambridge',
 'California Institute of Technology',
 'Princeton University',
 'University of Oxford',
 'Yale University',
 'Columbia University',
 'University of California, Berkeley',
 'University of Chicago',
 'Cornell University',
 'University of Pennsylvania',
 'University of Tokyo',
 'Johns Hopkins University',
 'Kyoto University',
 'University of California, Los Angeles',
 'University of California, San Diego',
 'Hebrew University of Jerusalem',
 'New York University',
 'Duke University',
 'Imperial College London',
 'University of Texas at Austin',
 'University College London',
 'Osaka University',
 'Northwestern University',
 'University of Toronto',
 'University of North Carolina at Chapel Hill',
 'University of Utah',
 'University of California, Santa Barbara',
 'McGill University',
 'Carnegie Mellon University',
 'University of Southern California',
 'University of California, Davis',
 'University of Colorado Boulder',
 'University of California, Irvine',
 'University of Arizona',
 'University of Rochester',
 'University of Florida',
 'Tel Aviv University',
 'Rice University',
 'Dartmouth College',
 'Vanderbilt University',
 'University of Edinburgh',
 'École Polytechnique',
 'Boston University',
 'University of Geneva',
 'Brown University',
 'University of British Columbia',
 'University of Maryland, College Park',
 'Karolinska Institute',
 'Nagoya University',
 'Seoul National University',
 'University of Manchester',
 'Sapienza University of Rome',
 'Case Western Reserve University',
 'Tohoku University',
 'Arizona State University',
 'Emory University',
 'University of Virginia',
 'Leiden University',
 'Tufts University',
 'Georgia Institute of Technology',
 'University of Zurich',
 'University of Helsinki',
 'Technical University of Munich',
 'University of Oslo',
 'University of Copenhagen',
 'University of Sydney',
 'University of Nottingham',
 'University of Bristol',
 'Utrecht University',
 'Mines ParisTech',
 'Keio University',
 'National University of Singapore',
 'Stony Brook University',
 'Lomonosov Moscow State University',
 'Australian National University',
 'University of Alberta',
 'Waseda University',
 'Peking University',
 'University of Notre Dame',
 'National Taiwan University',
 'Tsinghua University',
 'Kyushu University',
 'Tokyo Institute of Technology',
 'University of Melbourne',
 'University of Bonn',
 'Erasmus University Rotterdam',
 'Yonsei University',
 'Michigan State University',
 'University of the Witwatersrand',
 'Lund University',
 'Georgetown University',
 'Aarhus University',
 'University of Barcelona',
 'University of Amsterdam',
 'Uppsala University',
 'University of Iowa',
 'University of Groningen',
 'Korea Advanced Institute of Science and Technology (KAIST)',
 'Radboud University Nijmegen',
 'Korea University',
 'University of São Paulo',
 'University of Montreal',
 'Ghent University',
 'University of Glasgow',
 'University of Miami',
 'McMaster University',
 'University of Birmingham',
 'University of Texas at Dallas',
 'VU University Amsterdam',
 'Wake Forest University',
 'University of Southampton',
 'Nanyang Technological University',
 'University of New South Wales',
 'Osaka City University',
 'University of Leeds',
 'Kobe University',
 'University of Basel',
 'University of Hong Kong',
 'Humboldt University of Berlin',
 'Free University of Berlin',
 'University of Tübingen',
 'Goethe University Frankfurt',
 'University of Houston',
 'University of California, Santa Cruz',
 'University of Calgary',
 'University of Gothenburg',
 'University of Göttingen',
 'Monash University',
 'Southern Methodist University',
 'Yeshiva University',
 'Hanyang University',
 'University of Strasbourg',
 'University of Cincinnati',
 'University of Sheffield',
 'University of Hamburg',
 'George Washington University',
 'University of Milan',
 'Iowa State University',
 'University of Padua',
 'University of New Mexico',
 'Pohang University of Science and Technology',
 'Stockholm University',
 'Hokkaido University',
 'Fudan University',
 'University of Sussex',
 'Wayne State University',
 'University of Lausanne',
 'Shanghai Jiao Tong University',
 'Technical University of Denmark',
 'Complutense University of Madrid',
 'University of Cologne',
 'University of Bern',
 'Chinese University of Hong Kong',
 'University of Kansas',
 'University of Vienna',
 'Zhejiang University',
 'University of Georgia',
 'Cardiff University',
 'University of Münster',
 'University of Liverpool',
 'University of Ottawa',
 'University of Erlangen-Nuremberg',
 'Queen Mary University of London',
 'Karlsruhe Institute of Technology',
 'Nanjing University',
 'University of Illinois at Chicago',
 'University of Bologna',
 'University of Manitoba',
 'Joseph Fourier University',
 'University of California, Riverside',
 'Aix-Marseille University',
 'University of Western Australia',
 'Laval University',
 'University of Tennessee, Knoxville',
 'North Carolina State University',
 'Newcastle University',
 'Claude Bernard University Lyon 1',
 'University of Turin',
 'University of Kiel',
 'University of Connecticut',
 'Tulane University',
 'Brandeis University',
 'RWTH Aachen University',
 'Dalian University of Technology',
 'Rensselaer Polytechnic Institute',
 'Paris Descartes University',
 'National Cheng Kung University',
 'University of Delaware',
 'Vrije Universiteit Brussel',
 'Johannes Gutenberg University of Mainz',
 'Maastricht University',
 'University of Dundee',
 'University of Tsukuba',
 'Autonomous University of Barcelona',
 'Florida State University',
 'University of Texas at San Antonio',
 'Lehigh University',
 'University of Kentucky',
 'Drexel University',
 'University of Leicester',
 'Durham University',
 'Oregon State University',
 'University of Florence',
 'University of Cape Town',
 'University College Dublin',
 'University of Science and Technology of China',
 'Virginia Polytechnic Institute and State University',
 'University of Naples Federico II',
 'University of Auckland',
 'Delft University of Technology',
 'University of Aberdeen',
 'University of Lisbon',
 'Hiroshima University',
 'University of Waterloo',
 'Okayama University',
 'Chulalongkorn University',
 'Dalhousie University',
 'Saint Petersburg State University',
 'Norwegian University of Science and Technology',
 'University of Reading',
 'Umeå University',
 'University of Porto',
 'Hong Kong University of Science and Technology',
 'Sun Yat-sen University',
 'Medical College of Wisconsin',
 'Technical University of Berlin',
 'University of Stuttgart',
 'University of Valencia',
 'Linköping University',
 'University of Duisburg-Essen',
 'Ruhr University Bochum',
 'University of Bergen',
 'University of Pisa',
 'Autonomous University of Madrid',
 'Medical University of Vienna',
 'Stellenbosch University',
 'Medical University of South Carolina',
 'Charles University in Prague',
 'Kyungpook National University',
 'University of Liège',
 'University of Hull',
 'Northeastern University',
 'Kansas State University',
 'University of Vermont',
 'Rush University',
 'University of St Andrews',
 'University of Warwick',
 'University of Innsbruck',
 'Indian Institute of Technology Delhi',
 'Federal University of Rio de Janeiro',
 'University of Antwerp',
 'National and Kapodistrian University of Athens',
 'Boston College',
 'Gwangju Institute of Science and Technology',
 'University of York',
 'National Autonomous University of Mexico',
 'Yokohama National University',
 'University of Adelaide',
 'University of Genoa',
 'University of Pavia',
 'University of Oregon',
 'University of Navarra',
 'San Diego State University',
 'University of East Anglia',
 'University of Nebraska Medical Center',
 'University of Southern Denmark',
 'Eindhoven University of Technology',
 'Xiamen University',
 'University of Otago',
 'University of Santiago de Compostela',
 'University of Exeter',
 'Justus Liebig University Giessen',
 'Ben-Gurion University of the Negev',
 'Saint Louis University',
 'Colorado School of Mines',
 'University of Guelph',
 'University of Trieste',
 'Tongji University',
 'Eötvös Loránd University',
 'University of Eastern Finland',
 'Ewha Womans University',
 'City University of Hong Kong',
 'University of Victoria',
 'Kyung Hee University',
 'Hong Kong Polytechnic University',
 'Scuola Normale Superiore di Pisa',
 'University of Seville',
 'Chiba University',
 'University of Ferrara',
 'University of Bari Aldo Moro',
 'Polytechnic University of Milan',
 'Temple University',
 'University of Turku',
 'Aalto University',
 'Simon Fraser University',
 'Tianjin University',
 'Chalmers University of Technology',
 'Middle East Technical University',
 'York University',
 'Chonnam National University',
 'Chonbuk National University',
 'Kumamoto University',
 'Huazhong University of Science and Technology',
 'Polytechnic University of Catalonia',
 'National Chiao Tung University',
 'Tokyo University of Science',
 'Catholic University of the Sacred Heart',
 'Technical University of Madrid',
 'Nagasaki University',
 'National Tsing Hua University',
 'University of Warsaw',
 'King Saud University',
 'University of Bath',
 'Concordia University',
 'Niigata University',
 'University of Oulu',
 'Pompeu Fabra University',
 'Vienna University of Technology',
 'Sogang University',
 'University of Tampere',
 'Swedish University of Agricultural Sciences',
 'George Mason University',
 'Jilin University',
 'University of Delhi',
 'Wuhan University',
 'Pusan National University',
 'Miami University',
 'University of Twente',
 'Ajou University',
 'Syracuse University',
 'Lancaster University',
 'Pontifical Catholic University of Chile',
 'University of Chile',
 'University of Granada',
 'Kanazawa University',
 'University of Parma',
 'University of Siena',
 'Technical University of Dortmund',
 'University of KwaZulu-Natal',
 'Yokohama City University',
 'University College Cork',
 'Ohio University',
 'University of Modena and Reggio Emilia',
 'New Mexico State University',
 'University of Konstanz',
 'Shinshu University',
 'University of Strathclyde',
 'Polytechnic University of Valencia',
 'Harbin Institute of Technology',
 'University of Rennes 1',
 'Aristotle University of Thessaloniki',
 'Jagiellonian University',
 'University of Saskatchewan',
 'Juntendo University',
 'University of Wyoming',
 'Macquarie University',
 'University of Canterbury',
 'Illinois Institute of Technology',
 'Creighton University',
 'Bielefeld University',
 'University of Ulsan',
 'City University London',
 'Federal University of Minas Gerais',
 'South China University of Technology',
 'University of Surrey',
 'Indian Institute of Science',
 'Tokyo Metropolitan University',
 'Bar-Ilan University',
 'University of Maryland, Baltimore County',
 'University of Wollongong',
 'Flinders University',
 'Clemson University',
 'University of Brescia',
 'Georgia State University',
 'University of Fribourg',
 'Sichuan University',
 'University of Iceland',
 'University of Graz',
 'University of Zaragoza',
 'University of Ljubljana',
 'Victoria University of Wellington',
 'East China University of Science and Technology',
 'Konkuk University',
 'University of the Basque Country',
 'University of Nice Sophia Antipolis',
 'National Yang-Ming University',
 'Indian Institute of Technology Bombay',
 'Royal Holloway, University of London',
 'Panjab University',
 'Tampere University of Technology',
 'University of Coimbra',
 'University of Newcastle',
 'Auburn University',
 'University of Bremen',
 'Mahidol University',
 'University of Crete',
 'Bangor University',
 'University of Aveiro',
 'University of Palermo',
 'University of Tartu',
 'American University of Beirut',
 'University of Nantes',
 'University of Essex',
 'National Central University',
 'University of Catania',
 'Indian Institute of Technology Kanpur',
 'James Cook University',
 'Indian Institute of Technology Kharagpur',
 'Indian Institute of Technology Madras',
 'Plymouth University',
 'Polytechnic University of Turin',
 'University of Oviedo',
 'Ehime University',
 'University of Ioannina',
 'University of Cagliari',
 'Tottori University',
 'Federal University of Rio Grande do Sul',
 'Kent State University',
 'Hunan University',
 'Tokai University',
 'Aalborg University',
 'Osaka Prefecture University',
 'Chang Gung University',
 'University of Trento',
 'Semmelweis University',
 'University of Science and Technology Beijing',
 'National University of Ireland, Galway',
 'Istanbul University',
 'Tokyo University of Agriculture and Technology',
 'Queensland University of Technology',
 'University of Tasmania',
 'University of Pretoria',
 'Indian Institute of Technology Roorkee',
 'Curtin University',
 'Deakin University',
 'Tilburg University',
 'Inha University',
 'Chungnam National University',
 'University of Salamanca',
 'University of Alaska Fairbanks',
 'Birkbeck, University of London',
 'Griffith University',
 'Carleton University',
 'Massey University',
 'University of Patras',
 'National Chung Hsing University',
 'La Trobe University',
 'Missouri University of Science and Technology',
 'University of Idaho',
 'University of Portsmouth',
 'University of La Laguna',
 'Florida International University',
 'Howard University',
 'University of Hertfordshire',
 'Royal College of Surgeons in Ireland',
 'National Technical University of Athens',
 'University of Burgundy',
 'AGH University of Science and Technology',
 'Gifu University',
 'Hacettepe University',
 'Örebro University',
 'Memorial University of Newfoundland',
 'New Jersey Institute of Technology',
 'Keele University',
 'University of Jyväskylä',
 'Rochester Institute of Technology',
 'Portland State University',
 'East China Normal University',
 'University of Debrecen',
 'Old Dominion University',
 'Hong Kong Baptist University',
 'University of Minho',
 'University of Texas at Arlington',
 'Johannes Kepler University of Linz',
 'Warsaw University of Technology',
 'University of Toledo',
 'University of Vigo',
 'University of Kent',
 'Chung Yuan Christian University',
 'University of Haifa',
 'Swansea University',
 'China Agricultural University',
 'Marche Polytechnic University',
 'Heriot-Watt University',
 'Loughborough University',
 'Aston University',
 'University of Szeged',
 'Shanghai University',
 'University of South Australia',
 'Liverpool John Moores University',
 'Graz University of Technology',
 'Comenius University in Bratislava',
 'University of Stirling',
 'Swinburne University of Technology',
 'Masaryk University',
 'Showa University',
 'University of Tehran',
 'Wuhan University of Technology',
 'University of Neuchâtel',
 'Czech Technical University in Prague',
 'Istanbul Technical University',
 'Kaohsiung Medical University',
 'Yeungnam University',
 'University of Salento',
 'Blaise Pascal University',
 'University of Electronic Science and Technology of China',
 'Michigan Technological University',
 'University of Hohenheim',
 'Aberystwyth University',
 'Cairo University',
 'University of Murcia',
 'Taipei Medical University',
 'University of Bradford',
 'King Fahd University of Petroleum and Minerals',
 'University of Belgrade',
 'Budapest University of Technology and Economics',
 'Chongqing University',
 'Beijing Institute of Technology',
 'Manchester Metropolitan University',
 'Dublin City University',
 'National University of Ireland, Maynooth',
 'Capital Medical University',
 'University of Brighton',
 'University of Regina',
 'Sejong University',
 'Sharif University of Technology',
 'Chung-Ang University',
 'Murdoch University',
 'Vilnius University',
 'University of Maribor',
 'University of Texas at El Paso',
 'University of Alcalá',
 'Tehran University of Medical Sciences',
 'Florida Institute of Technology',
 'National Chung Cheng University',
 'Bilkent University',
 'National Taiwan Normal University',
 'Saitama University',
 'RMIT University',
 'University of Greifswald',
 'University of Pécs',
 'Oakland University',
 'University of North Carolina at Greensboro',
 'Ocean University of China',
 'Chiang Mai University',
 'University of Waikato',
 'Makerere University',
 'University of Brasília',
 'National University of Córdoba',
 'Federal University of Santa Catarina',
 'National Taiwan Ocean University',
 'Boğaziçi University',
 'Jadavpur University',
 'University of Mannheim',
 'Charles Darwin University',
 'University of Southern Mississippi',
 'Carlos III University of Madrid',
 'Novosibirsk State University',
 'United Arab Emirates University',
 'Federal University of São Carlos',
 'Feng Chia University',
 'University of A Coruña',
 'Isfahan University of Technology',
 'University of Limerick',
 'Northwestern Polytechnical University',
 'Alexandria University',
 'Yuan Ze University',
 'University of Cyprus',
 'University of Bucharest',
 'Amirkabir University of Technology',
 'University of Chemistry and Technology, Prague',
 'Federal University of Bahia',
 'University of Seoul',
 'Federico Santa María Technical University',
 'Fu Jen Catholic University',
 'Xidian University',
 'King Abdulaziz University',
 'Iran University of Science and Technology',
 'I-Shou University',
 'National Taipei University of Technology',
 'Moscow Institute of Physics and Technology',
 'University of Bordeaux',
 'Renmin University of China',
 'University of Calcutta',
 'China University of Geosciences (Wuhan)',
 'University of Central Lancashire',
 'ETH Zurich – Swiss Federal Institute of Technology Zurich',
 'University of San Francisco',
 'University of Wisconsin-Madison',
 'University of Illinois at Urbana-Champaign',
 'University of Michigan',
 'Washington University in St Louis',
 'University of Washington',
 'Purdue University',
 'Paris-Sud University',
 'University of Minnesota',
 'Technion Israel Institute of Technology',
 'Ohio State University',
 'École Normale Supérieure',
 'Pierre and Marie Curie University',
 'Pennsylvania State University',
 'University of Pittsburgh',
 'Texas A&M University',
 'The University of Queensland',
 'King’s College London',
 'Indiana University',
 'Paris Diderot University – Paris 7',
 'KTH Royal Institute of Technology',
 'University of Freiburg',
 'Université Libre de Bruxelles',
 'University of Western Ontario',
 'University of South Florida',
 'Oregon Health and Science University',
 'Université Catholique de Louvain',
 'University of Missouri',
 'Trinity College Dublin',
 'Sungkyunkwan University (SKKU)',
 'University of Massachusetts',
 'Louisiana State University',
 'University of Würzburg',
 'University of Oklahoma',
 'Colorado State University',
 'University at Buffalo',
 'Queen’s University',
 'Ulm University',
 'Wageningen University and Research Center',
 'Washington State University',
 'University of South Carolina',
 'London School of Economics and Political Science',
 'University of Rome II – Tor Vergata',
 'University of Nebraska-Lincoln',
 'Queen’s University Belfast',
 'St George’s, University of London',
 'Oklahoma State University',
 'Verona University',
 'Tokyo Medical and Dental University (TMDU)',
 'Xi’an Jiaotong University',
 'Brunel University London',
 'University of Milan-Bicocca',
 'State University of Campinas',
 'Tokushima University',
 'École Normale Supérieure de Lyon',
 'University of Hawai’i at Mānoa',
 'University of Arkansas',
 'Texas Tech University',
 'Leibniz University of Hanover',
 'Otto von Guericke University of Magdeburg',
 'Université de Sherbrooke',
 'Bayreuth University',
 'University of Wisconsin-Milwaukee',
 'Montana State University',
 'Lille 1 University – Science and Technology',
 'University of the Andes, Colombia',
 'University of Montana',
 'Binghamton University, State University of New York',
 'University of Rovira i Virgili',
 'Kinki University',
 'Lille 2 University – Health and Law',
 'São Paulo State University (UNESP)',

To associate to each university the number of DataFrames in which it appears, we define the dictionary *diz_university* and update it as follows: for each university name in the three DataFrames, if that name has not yet been entered in the dictionary, we enter it as a key and we assign 1 to the corresponding value. If the name of the university is already present in the dictionary, we increase the associated value by 1.

In [118]:
diz_university={}

for uni in total_list:
    if uni not in diz_university:
        diz_university[uni]=1
    else:
        diz_university[uni]+=1
        
diz_university

{'Harvard University': 3,
 'Massachusetts Institute of Technology': 3,
 'Stanford University': 3,
 'University of Cambridge': 3,
 'California Institute of Technology': 3,
 'Princeton University': 3,
 'University of Oxford': 3,
 'Yale University': 3,
 'Columbia University': 3,
 'University of California, Berkeley': 3,
 'University of Chicago': 3,
 'Cornell University': 3,
 'University of Pennsylvania': 3,
 'University of Tokyo': 3,
 'Johns Hopkins University': 3,
 'Kyoto University': 3,
 'University of California, Los Angeles': 3,
 'University of California, San Diego': 3,
 'Hebrew University of Jerusalem': 3,
 'New York University': 3,
 'Duke University': 3,
 'Imperial College London': 2,
 'University of Texas at Austin': 3,
 'University College London': 3,
 'Osaka University': 3,
 'Northwestern University': 3,
 'University of Toronto': 3,
 'University of North Carolina at Chapel Hill': 3,
 'University of Utah': 3,
 'University of California, Santa Barbara': 3,
 'McGill University': 3,
 'Carnegie Mellon University': 3,
 'University of Southern California': 3,
 'University of California, Davis': 3,
 'University of Colorado Boulder': 3,
 'University of California, Irvine': 3,
 'University of Arizona': 3,
 'University of Rochester': 3,
 'University of Florida': 3,
 'Tel Aviv University': 3,
 'Rice University': 3,
 'Dartmouth College': 3,
 'Vanderbilt University': 3,
 'University of Edinburgh': 3,
 'École Polytechnique': 3,
 'Boston University': 3,
 'University of Geneva': 3,
 'Brown University': 3,
 'University of British Columbia': 3,
 'University of Maryland, College Park': 3,
 'Karolinska Institute': 3,
 'Nagoya University': 3,
 'Seoul National University': 3,
 'University of Manchester': 3,
 'Sapienza University of Rome': 3,
 'Case Western Reserve University': 3,
 'Tohoku University': 3,
 'Arizona State University': 3,
 'Emory University': 3,
 'University of Virginia': 3,
 'Leiden University': 3,
 'Tufts University': 3,
 'Georgia Institute of Technology': 3,
 'University of Zurich': 3,
 'University of Helsinki': 3,
 'Technical University of Munich': 3,
 'University of Oslo': 3,
 'University of Copenhagen': 3,
 'University of Sydney': 3,
 'University of Nottingham': 3,
 'University of Bristol': 3,
 'Utrecht University': 3,
 'Mines ParisTech': 3,
 'Keio University': 3,
 'National University of Singapore': 3,
 'Stony Brook University': 3,
 'Lomonosov Moscow State University': 3,
 'Australian National University': 3,
 'University of Alberta': 3,
 'Waseda University': 3,
 'Peking University': 3,
 'University of Notre Dame': 3,
 'National Taiwan University': 3,
 'Tsinghua University': 3,
 'Kyushu University': 3,
 'Tokyo Institute of Technology': 3,
 'University of Melbourne': 3,
 'University of Bonn': 3,
 'Erasmus University Rotterdam': 3,
 'Yonsei University': 3,
 'Michigan State University': 3,
 'University of the Witwatersrand': 3,
 'Lund University': 3,
 'Georgetown University': 3,
 'Aarhus University': 3,
 'University of Barcelona': 3,
 'University of Amsterdam': 3,
 'Uppsala University': 3,
 'University of Iowa': 3,
 'University of Groningen': 3,
 'Korea Advanced Institute of Science and Technology (KAIST)': 3,
 'Radboud University Nijmegen': 3,
 'Korea University': 3,
 'University of São Paulo': 3,
 'University of Montreal': 3,
 'Ghent University': 3,
 'University of Glasgow': 3,
 'University of Miami': 3,
 'McMaster University': 3,
 'University of Birmingham': 3,
 'University of Texas at Dallas': 3,
 'VU University Amsterdam': 3,
 'Wake Forest University': 3,
 'University of Southampton': 3,
 'Nanyang Technological University': 3,
 'University of New South Wales': 3,
 'Osaka City University': 3,
 'University of Leeds': 3,
 'Kobe University': 3,
 'University of Basel': 3,
 'University of Hong Kong': 3,
 'Humboldt University of Berlin': 2,
 'Free University of Berlin': 2,
 'University of Tübingen': 3,
 'Goethe University Frankfurt': 3,
 'University of Houston': 3,
 'University of California, Santa Cruz': 3,
 'University of Calgary': 3,
 'University of Gothenburg': 3,
 'University of Göttingen': 3,
 'Monash University': 3,
 'Southern Methodist University': 3,
 'Yeshiva University': 3,
 'Hanyang University': 3,
 'University of Strasbourg': 3,
 'University of Cincinnati': 3,
 'University of Sheffield': 3,
 'University of Hamburg': 3,
 'George Washington University': 3,
 'University of Milan': 3,
 'Iowa State University': 3,
 'University of Padua': 3,
 'University of New Mexico': 3,
 'Pohang University of Science and Technology': 3,
 'Stockholm University': 3,
 'Hokkaido University': 3,
 'Fudan University': 3,
 'University of Sussex': 3,
 'Wayne State University': 3,
 'University of Lausanne': 3,
 'Shanghai Jiao Tong University': 3,
 'Technical University of Denmark': 3,
 'Complutense University of Madrid': 3,
 'University of Cologne': 2,
 'University of Bern': 3,
 'Chinese University of Hong Kong': 3,
 'University of Kansas': 3,
 'University of Vienna': 3,
 'Zhejiang University': 3,
 'University of Georgia': 3,
 'Cardiff University': 3,
 'University of Münster': 3,
 'University of Liverpool': 3,
 'University of Ottawa': 3,
 'University of Erlangen-Nuremberg': 3,
 'Queen Mary University of London': 3,
 'Karlsruhe Institute of Technology': 3,
 'Nanjing University': 3,
 'University of Illinois at Chicago': 3,
 'University of Bologna': 3,
 'University of Manitoba': 3,
 'Joseph Fourier University': 3,
 'University of California, Riverside': 3,
 'Aix-Marseille University': 3,
 'University of Western Australia': 3,
 'Laval University': 3,
 'University of Tennessee, Knoxville': 3,
 'North Carolina State University': 3,
 'Newcastle University': 3,
 'Claude Bernard University Lyon 1': 3,
 'University of Turin': 3,
 'University of Kiel': 3,
 'University of Connecticut': 3,
 'Tulane University': 3,
 'Brandeis University': 3,
 'RWTH Aachen University': 3,
 'Dalian University of Technology': 3,
 'Rensselaer Polytechnic Institute': 3,
 'Paris Descartes University': 3,
 'National Cheng Kung University': 3,
 'University of Delaware': 3,
 'Vrije Universiteit Brussel': 3,
 'Johannes Gutenberg University of Mainz': 3,
 'Maastricht University': 3,
 'University of Dundee': 3,
 'University of Tsukuba': 3,
 'Autonomous University of Barcelona': 3,
 'Florida State University': 3,
 'University of Texas at San Antonio': 3,
 'Lehigh University': 3,
 'University of Kentucky': 3,
 'Drexel University': 3,
 'University of Leicester': 3,
 'Durham University': 3,
 'Oregon State University': 3,
 'University of Florence': 3,
 'University of Cape Town': 3,
 'University College Dublin': 3,
 'University of Science and Technology of China': 3,
 'Virginia Polytechnic Institute and State University': 3,
 'University of Naples Federico II': 3,
 'University of Auckland': 3,
 'Delft University of Technology': 3,
 'University of Aberdeen': 3,
 'University of Lisbon': 3,
 'Hiroshima University': 3,
 'University of Waterloo': 3,
 'Okayama University': 3,
 'Chulalongkorn University': 2,
 'Dalhousie University': 3,
 'Saint Petersburg State University': 3,
 'Norwegian University of Science and Technology': 3,
 'University of Reading': 3,
 'Umeå University': 3,
 'University of Porto': 3,
 'Hong Kong University of Science and Technology': 3,
 'Sun Yat-sen University': 3,
 'Medical College of Wisconsin': 3,
 'Technical University of Berlin': 3,
 'University of Stuttgart': 3,
 'University of Valencia': 3,
 'Linköping University': 3,
 'University of Duisburg-Essen': 3,
 'Ruhr University Bochum': 3,
 'University of Bergen': 3,
 'University of Pisa': 3,
 'Autonomous University of Madrid': 3,
 'Medical University of Vienna': 3,
 'Stellenbosch University': 3,
 'Medical University of South Carolina': 3,
 'Charles University in Prague': 3,
 'Kyungpook National University': 3,
 'University of Liège': 3,
 'University of Hull': 2,
 'Northeastern University': 3,
 'Kansas State University': 3,
 'University of Vermont': 3,
 'Rush University': 3,
 'University of St Andrews': 3,
 'University of Warwick': 3,
 'University of Innsbruck': 3,
 'Indian Institute of Technology Delhi': 2,
 'Federal University of Rio de Janeiro': 3,
 'University of Antwerp': 3,
 'National and Kapodistrian University of Athens': 3,
 'Boston College': 3,
 'Gwangju Institute of Science and Technology': 2,
 'University of York': 3,
 'National Autonomous University of Mexico': 3,
 'Yokohama National University': 2,
 'University of Adelaide': 3,
 'University of Genoa': 3,
 'University of Pavia': 3,
 'University of Oregon': 3,
 'University of Navarra': 2,
 'San Diego State University': 3,
 'University of East Anglia': 3,
 'University of Nebraska Medical Center': 3,
 'University of Southern Denmark': 3,
 'Eindhoven University of Technology': 3,
 'Xiamen University': 3,
 'University of Otago': 3,
 'University of Santiago de Compostela': 3,
 'University of Exeter': 3,
 'Justus Liebig University Giessen': 2,
 'Ben-Gurion University of the Negev': 3,
 'Saint Louis University': 3,
 'Colorado School of Mines': 2,
 'University of Guelph': 3,
 'University of Trieste': 3,
 'Tongji University': 3,
 'Eötvös Loránd University': 3,
 'University of Eastern Finland': 3,
 'Ewha Womans University': 3,
 'City University of Hong Kong': 3,
 'University of Victoria': 3,
 'Kyung Hee University': 3,
 'Hong Kong Polytechnic University': 3,
 'Scuola Normale Superiore di Pisa': 3,
 'University of Seville': 3,
 'Chiba University': 3,
 'University of Ferrara': 3,
 'University of Bari Aldo Moro': 3,
 'Polytechnic University of Milan': 2,
 'Temple University': 3,
 'University of Turku': 3,
 'Aalto University': 3,
 'Simon Fraser University': 3,
 'Tianjin University': 3,
 'Chalmers University of Technology': 3,
 'Middle East Technical University': 2,
 'York University': 3,
 'Chonnam National University': 2,
 'Chonbuk National University': 2,
 'Kumamoto University': 3,
 'Huazhong University of Science and Technology': 3,
 'Polytechnic University of Catalonia': 3,
 'National Chiao Tung University': 3,
 'Tokyo University of Science': 3,
 'Catholic University of the Sacred Heart': 3,
 'Technical University of Madrid': 2,
 'Nagasaki University': 3,
 'National Tsing Hua University': 3,
 'University of Warsaw': 3,
 'King Saud University': 3,
 'University of Bath': 3,
 'Concordia University': 3,
 'Niigata University': 3,
 'University of Oulu': 3,
 'Pompeu Fabra University': 3,
 'Vienna University of Technology': 3,
 'Sogang University': 2,
 'University of Tampere': 2,
 'Swedish University of Agricultural Sciences': 3,
 'George Mason University': 3,
 'Jilin University': 3,
 'University of Delhi': 2,
 'Wuhan University': 3,
 'Pusan National University': 3,
 'Miami University': 2,
 'University of Twente': 3,
 'Ajou University': 2,
 'Syracuse University': 3,
 'Lancaster University': 3,
 'Pontifical Catholic University of Chile': 3,
 'University of Chile': 3,
 'University of Granada': 3,
 'Kanazawa University': 3,
 'University of Parma': 3,
 'University of Siena': 3,
 'Technical University of Dortmund': 3,
 'University of KwaZulu-Natal': 3,
 'Yokohama City University': 2,
 'University College Cork': 3,
 'Ohio University': 3,
 'University of Modena and Reggio Emilia': 2,
 'New Mexico State University': 3,
 'University of Konstanz': 3,
 'Shinshu University': 2,
 'University of Strathclyde': 3,
 'Polytechnic University of Valencia': 3,
 'Harbin Institute of Technology': 3,
 'University of Rennes 1': 3,
 'Aristotle University of Thessaloniki': 3,
 'Jagiellonian University': 3,
 'University of Saskatchewan': 3,
 'Juntendo University': 3,
 'University of Wyoming': 3,
 'Macquarie University': 3,
 'University of Canterbury': 3,
 'Illinois Institute of Technology': 2,
 'Creighton University': 2,
 'Bielefeld University': 3,
 'University of Ulsan': 2,
 'City University London': 2,
 'Federal University of Minas Gerais': 3,
 'South China University of Technology': 3,
 'University of Surrey': 3,
 'Indian Institute of Science': 3,
 'Tokyo Metropolitan University': 3,
 'Bar-Ilan University': 3,
 'University of Maryland, Baltimore County': 3,
 'University of Wollongong': 3,
 'Flinders University': 3,
 'Clemson University': 3,
 'University of Brescia': 2,
 'Georgia State University': 2,
 'University of Fribourg': 3,
 'Sichuan University': 3,
 'University of Iceland': 2,
 'University of Graz': 3,
 'University of Zaragoza': 3,
 'University of Ljubljana': 3,
 'Victoria University of Wellington': 3,
 'East China University of Science and Technology': 3,
 'Konkuk University': 2,
 'University of the Basque Country': 3,
 'University of Nice Sophia Antipolis': 3,
 'National Yang-Ming University': 3,
 'Indian Institute of Technology Bombay': 2,
 'Royal Holloway, University of London': 3,
 'Panjab University': 2,
 'Tampere University of Technology': 2,
 'University of Coimbra': 3,
 'University of Newcastle': 3,
 'Auburn University': 3,
 'University of Bremen': 3,
 'Mahidol University': 2,
 'University of Crete': 2,
 'Bangor University': 3,
 'University of Aveiro': 2,
 'University of Palermo': 3,
 'University of Tartu': 2,
 'American University of Beirut': 2,
 'University of Nantes': 2,
 'University of Essex': 3,
 'National Central University': 3,
 'University of Catania': 2,
 'Indian Institute of Technology Kanpur': 2,
 'James Cook University': 3,
 'Indian Institute of Technology Kharagpur': 3,
 'Indian Institute of Technology Madras': 2,
 'Plymouth University': 2,
 'Polytechnic University of Turin': 3,
 'University of Oviedo': 2,
 'Ehime University': 3,
 'University of Ioannina': 2,
 'University of Cagliari': 3,
 'Tottori University': 2,
 'Federal University of Rio Grande do Sul': 3,
 'Kent State University': 3,
 'Hunan University': 2,
 'Tokai University': 2,
 'Aalborg University': 3,
 'Osaka Prefecture University': 3,
 'Chang Gung University': 3,
 'University of Trento': 2,
 'Semmelweis University': 2,
 'University of Science and Technology Beijing': 2,
 'National University of Ireland, Galway': 2,
 'Istanbul University': 3,
 'Tokyo University of Agriculture and Technology': 3,
 'Queensland University of Technology': 3,
 'University of Tasmania': 3,
 'University of Pretoria': 3,
 'Indian Institute of Technology Roorkee': 2,
 'Curtin University': 3,
 'Deakin University': 3,
 'Tilburg University': 3,
 'Inha University': 2,
 'Chungnam National University': 3,
 'University of Salamanca': 2,
 'University of Alaska Fairbanks': 3,
 'Birkbeck, University of London': 3,
 'Griffith University': 3,
 'Carleton University': 3,
 'Massey University': 3,
 'University of Patras': 2,
 'National Chung Hsing University': 2,
 'La Trobe University': 3,
 'Missouri University of Science and Technology': 2,
 'University of Idaho': 3,
 'University of Portsmouth': 2,
 'University of La Laguna': 2,
 'Florida International University': 3,
 'Howard University': 3,
 'University of Hertfordshire': 3,
 'Royal College of Surgeons in Ireland': 2,
 'National Technical University of Athens': 2,
 'University of Burgundy': 2,
 'AGH University of Science and Technology': 2,
 'Gifu University': 3,
 'Hacettepe University': 3,
 'Örebro University': 2,
 'Memorial University of Newfoundland': 3,
 'New Jersey Institute of Technology': 3,
 'Keele University': 2,
 'University of Jyväskylä': 3,
 'Rochester Institute of Technology': 2,
 'Portland State University': 3,
 'East China Normal University': 2,
 'University of Debrecen': 2,
 'Old Dominion University': 3,
 'Hong Kong Baptist University': 2,
 'University of Minho': 2,
 'University of Texas at Arlington': 2,
 'Johannes Kepler University of Linz': 2,
 'Warsaw University of Technology': 2,
 'University of Toledo': 2,
 'University of Vigo': 3,
 'University of Kent': 2,
 'Chung Yuan Christian University': 2,
 'University of Haifa': 3,
 'Swansea University': 3,
 'China Agricultural University': 3,
 'Marche Polytechnic University': 2,
 'Heriot-Watt University': 2,
 'Loughborough University': 3,
 'Aston University': 2,
 'University of Szeged': 3,
 'Shanghai University': 2,
 'University of South Australia': 2,
 'Liverpool John Moores University': 2,
 'Graz University of Technology': 2,
 'Comenius University in Bratislava': 2,
 'University of Stirling': 2,
 'Swinburne University of Technology': 3,
 'Masaryk University': 2,
 'Showa University': 2,
 'University of Tehran': 3,
 'Wuhan University of Technology': 2,
 'University of Neuchâtel': 2,
 'Czech Technical University in Prague': 2,
 'Istanbul Technical University': 2,
 'Kaohsiung Medical University': 2,
 'Yeungnam University': 2,
 'University of Salento': 2,
 'Blaise Pascal University': 2,
 'University of Electronic Science and Technology of China': 2,
 'Michigan Technological University': 3,
 'University of Hohenheim': 2,
 'Aberystwyth University': 2,
 'Cairo University': 3,
 'University of Murcia': 2,
 'Taipei Medical University': 2,
 'University of Bradford': 3,
 'King Fahd University of Petroleum and Minerals': 3,
 'University of Belgrade': 3,
 'Budapest University of Technology and Economics': 2,
 'Chongqing University': 2,
 'Beijing Institute of Technology': 2,
 'Manchester Metropolitan University': 2,
 'Dublin City University': 2,
 'National University of Ireland, Maynooth': 2,
 'Capital Medical University': 3,
 'University of Brighton': 2,
 'University of Regina': 2,
 'Sejong University': 2,
 'Sharif University of Technology': 3,
 'Chung-Ang University': 2,
 'Murdoch University': 3,
 'Vilnius University': 2,
 'University of Maribor': 2,
 'University of Texas at El Paso': 2,
 'University of Alcalá': 2,
 'Tehran University of Medical Sciences': 2,
 'Florida Institute of Technology': 2,
 'National Chung Cheng University': 2,
 'Bilkent University': 2,
 'National Taiwan Normal University': 2,
 'Saitama University': 2,
 'RMIT University': 2,
 'University of Greifswald': 3,
 'University of Pécs': 2,
 'Oakland University': 2,
 'University of North Carolina at Greensboro': 2,
 'Ocean University of China': 2,
 'Chiang Mai University': 2,
 'University of Waikato': 2,
 'Makerere University': 2,
 'University of Brasília': 2,
 'National University of Córdoba': 2,
 'Federal University of Santa Catarina': 2,
 'National Taiwan Ocean University': 2,
 'Boğaziçi University': 2,
 'Jadavpur University': 2,
 'University of Mannheim': 2,
 'Charles Darwin University': 2,
 'University of Southern Mississippi': 3,
 'Carlos III University of Madrid': 2,
 'Novosibirsk State University': 2,
 'United Arab Emirates University': 2,
 'Federal University of São Carlos': 3,
 'Feng Chia University': 2,
 'University of A Coruña': 2,
 'Isfahan University of Technology': 2,
 'University of Limerick': 2,
 'Northwestern Polytechnical University': 2,
 'Alexandria University': 2,
 'Yuan Ze University': 2,
 'University of Cyprus': 2,
 'University of Bucharest': 2,
 'Amirkabir University of Technology': 2,
 'University of Chemistry and Technology, Prague': 2,
 'Federal University of Bahia': 2,
 'University of Seoul': 2,
 'Federico Santa María Technical University': 2,
 'Fu Jen Catholic University': 2,
 'Xidian University': 2,
 'King Abdulaziz University': 3,
 'Iran University of Science and Technology': 2,
 'I-Shou University': 2,
 'National Taipei University of Technology': 2,
 'Moscow Institute of Physics and Technology': 2,
 'University of Bordeaux': 3,
 'Renmin University of China': 2,
 'University of Calcutta': 3,
 'China University of Geosciences (Wuhan)': 2,
 'University of Central Lancashire': 2,
 'ETH Zurich – Swiss Federal Institute of Technology Zurich': 3,
 'University of San Francisco': 3,
 'University of Wisconsin-Madison': 3,
 'University of Illinois at Urbana-Champaign': 3,
 'University of Michigan': 3,
 'Washington University in St Louis': 3,
 'University of Washington': 3,
 'Purdue University': 3,
 'Paris-Sud University': 2,
 'University of Minnesota': 3,
 'Technion Israel Institute of Technology': 3,
 'Ohio State University': 3,
 'École Normale Supérieure': 2,
 'Pierre and Marie Curie University': 3,
 'Pennsylvania State University': 3,
 'University of Pittsburgh': 3,
 'Texas A&M University': 3,
 'The University of Queensland': 3,

### 11. In the times ranking, compute the number of times each university appears

To calculate the number of times each university appears in the DataFrame *times* we use the `size()` function from `numpy` which in this case gives us the number of elements grouped by `groupby`, therefore the number of times each given name appears.

In [119]:
times_appearances=pd.DataFrame(list_times.groupby('university_name').size().reset_index())
times_appearances.rename(columns={0:'Appearances'}, inplace=True)
times_appearances

                              university_name  Appearances
0    AGH University of Science and Technology            1
1                          Aalborg University            5
2                            Aalto University            5
3                           Aarhus University            6
4                      Aberystwyth University            5
..                                        ...          ...
813                  École Normale Supérieure            6
814          École Normale Supérieure de Lyon            6
815                       École Polytechnique            6
816  École Polytechnique Fédérale de Lausanne            6
817                         Örebro University            1

[818 rows x 2 columns]

### 12. Find the universities that appear at most twice in the times ranking.

In [120]:
times_appearances[times_appearances['Appearances']<=2]

                              university_name  Appearances
0    AGH University of Science and Technology            1
5                  Adam Mickiewicz University            1
6                    Aix-Marseille University            1
7                             Ajou University            1
9              Alexandru Ioan Cuza University            1
..                                        ...          ...
806                  Yokohama City University            1
807              Yokohama National University            1
810                        Yuan Ze University            2
811               Yıldız Technical University            1
817                         Örebro University            1

[408 rows x 2 columns]

# 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

In [121]:
times_rank=list_times[['university_name_normalized', 'world_rank', 'year']].copy()
shanghai_rank=list_shanghai[['university_name_normalized', 'world_rank', 'year']].copy()
cwur_rank=list_cwur[['university_name_normalized', 'world_rank', 'year']].copy()

We check if the years of the three rankings are expressed with values of the same type:

In [122]:
times_rank['year'].dtype==shanghai_rank['year'].dtype==cwur_rank['year'].dtype

True

Some data of the positions in the rankings have a symbol in addition to the number. We define the *values_adjustment* function to remove these symbols so that we can compare the numeric values with each other.


*values_adjustment* takes a string as input (the vale to be fixed); in the case that the string provided is an interval (it is the position expressed as interval), the two extremes of the interval are returned, separated by the symbol "-". If the string gave as input is not a range, only the numeric value is returned, without symbols.

In [123]:
def values_adjustment(string):
    expression=interval.search(string)
    num1=expression.group('num1')
    num2=expression.group('num2')
    if (num1!='') and (num2!=''):
        return (str(num1)+'-'+str(num2))
    else:
        if num1!='':
            return str(num1)
        if num2!='':
            return str(num2)
    return np.NaN
# If for example there is '=106' we make it '106' so that '106'=='106' and not '=106'!='106'

We apply the *values_adjustment* function to the *world_rank* fields of the DataFrame that have some symbols in addition to the number value of the position in the ranking.

In [124]:
times_rank['world_rank']=times_rank['world_rank'].apply(values_adjustment)
shanghai_rank['world_rank']=shanghai_rank['world_rank'].apply(values_adjustment)

In [125]:
times_rank.tail(5)

        university_name_normalized world_rank  year
2598           Yeungnam University    601-800  2016
2599   Yıldız Technical University    601-800  2016
2600      Yokohama City University    601-800  2016
2601  Yokohama National University    601-800  2016
2602            Yuan Ze University    601-800  2016

In [126]:
shanghai_rank.tail(5)

                university_name_normalized world_rank  year
4868               University of Jyväskylä    401-500  2015
4873           University of Milan-Bicocca    401-500  2015
4875                University of Oklahoma    401-500  2015
4884   University of Rome II – Tor Vergata    401-500  2015
4886  University of Santiago de Compostela    401-500  2015

We begin to create a DataFrame containing the names of the universities, the year of evaluation and the position in the three different rankings using the `merge` function on the *times_rank* and *shanghai_rank* DataFrames.

In [127]:
full_rank=pd.merge(times_rank[['university_name_normalized', 'year', 'world_rank']], shanghai_rank[['university_name_normalized', 'year', 'world_rank']], on=['university_name_normalized', 'year'], suffixes=['_times', '_shanghai'])
full_rank.head()

,university_name_normalized,year,world_rank_times,world_rank_shanghai
0,Harvard University,2011,1,1
1,California Institute of Technology,2011,2,6
2,Massachusetts Institute of Technology,2011,3,3
3,Stanford University,2011,4,2
4,Princeton University,2011,5,7

In [128]:
cwur_rank['world_rank'].dtype

dtype('int64')

We convert the values of the *world_rank* field of the *cwur_rank* table from 'int64' to 'string' and rename the field so as not to confuse it with the corresponding fields of the other DataFrames used.

In [129]:
cwur_rank['world_rank']=cwur_rank['world_rank'].astype(str)
cwur_rank.rename(columns={'world_rank':'world_rank_cwur'}, inplace=True)

We use the `merge` function again to finish the construction of the *full_rank* DataFrame by also inserting the data relating to the positions of the universities in the *cwur_rank* ranking.
Finally we only display the rows of the *full_rank* table that have the same value in the *world_rank_times*, *world_rank_shanghai* and *world_rank_cwur* fields.

In [130]:
full_rank=pd.merge(full_rank[['university_name_normalized', 'year', 'world_rank_times', 'world_rank_shanghai']], cwur_rank[['university_name_normalized', 'year', 'world_rank_cwur']], on=['university_name_normalized', 'year'])
full_rank[(full_rank['world_rank_times']==full_rank['world_rank_shanghai']) & (full_rank['world_rank_shanghai']==full_rank['world_rank_cwur'])]

,university_name_normalized,year,world_rank_times,world_rank_shanghai,world_rank_cwur
80,Stanford University,2013,2,2,2